miro-kostadinov/tmos/tags/tmos/5.02.1.0/hardware/at91/cortex-m3/sam3s/series_map.h
/**************************************************************************//**
 * @ingroup	 hardware_sam3s
 * @{
 * @file     hardware/at91/cortex-m3/sam3s/series_map.h
 * @brief    SAM3S series CPP header
 * @version  V3.00
 * @date     28. November 2010
 * @author	 Miroslav Kostadinov
 *
 * @}
 *
 ******************************************************************************/

#ifndef SERIES_MAP_H_
#define SERIES_MAP_H_

/* ************************************************************************** */
/*   REGISTER ACCESS DEFINITIONS FOR SAM3S */
/* ************************************************************************** */
/**
 * @addtogroup SAM3S_reg Registers Access Definitions
 * @ingroup	 hardware_sam3s
 * @{
 */

/* ========== Register definition for HSMCI peripheral ========== */
#define REG_HSMCI_CR        REG_ACCESS(WoReg, 0x40000000U) //!< (HSMCI) Control Register */
#define REG_HSMCI_MR        REG_ACCESS(RwReg, 0x40000004U) //!< (HSMCI) Mode Register */
#define REG_HSMCI_DTOR      REG_ACCESS(RwReg, 0x40000008U) //!< (HSMCI) Data Timeout Register */
#define REG_HSMCI_SDCR      REG_ACCESS(RwReg, 0x4000000CU) //!< (HSMCI) SD/SDIO Card Register */
#define REG_HSMCI_ARGR      REG_ACCESS(RwReg, 0x40000010U) //!< (HSMCI) Argument Register */
#define REG_HSMCI_CMDR      REG_ACCESS(WoReg, 0x40000014U) //!< (HSMCI) Command Register */
#define REG_HSMCI_BLKR      REG_ACCESS(RwReg, 0x40000018U) //!< (HSMCI) Block Register */
#define REG_HSMCI_CSTOR     REG_ACCESS(RwReg, 0x4000001CU) //!< (HSMCI) Completion Signal Timeout Register */
#define REG_HSMCI_RSPR      REG_ACCESS(RoReg, 0x40000020U) //!< (HSMCI) Response Register */
#define REG_HSMCI_RDR       REG_ACCESS(RoReg, 0x40000030U) //!< (HSMCI) Receive Data Register */
#define REG_HSMCI_TDR       REG_ACCESS(WoReg, 0x40000034U) //!< (HSMCI) Transmit Data Register */
#define REG_HSMCI_SR        REG_ACCESS(RoReg, 0x40000040U) //!< (HSMCI) Status Register */
#define REG_HSMCI_IER       REG_ACCESS(WoReg, 0x40000044U) //!< (HSMCI) Interrupt Enable Register */
#define REG_HSMCI_IDR       REG_ACCESS(WoReg, 0x40000048U) //!< (HSMCI) Interrupt Disable Register */
#define REG_HSMCI_IMR       REG_ACCESS(RoReg, 0x4000004CU) //!< (HSMCI) Interrupt Mask Register */
#define REG_HSMCI_CFG       REG_ACCESS(RwReg, 0x40000054U) //!< (HSMCI) Configuration Register */
#define REG_HSMCI_WPMR      REG_ACCESS(RwReg, 0x400000E4U) //!< (HSMCI) Write Protection Mode Register */
#define REG_HSMCI_WPSR      REG_ACCESS(RoReg, 0x400000E8U) //!< (HSMCI) Write Protection Status Register */
#define REG_HSMCI_RPR       REG_ACCESS(RwReg, 0x40000100U) //!< (HSMCI) Receive Pointer Register */
#define REG_HSMCI_RCR       REG_ACCESS(RwReg, 0x40000104U) //!< (HSMCI) Receive Counter Register */
#define REG_HSMCI_TPR       REG_ACCESS(RwReg, 0x40000108U) //!< (HSMCI) Transmit Pointer Register */
#define REG_HSMCI_TCR       REG_ACCESS(RwReg, 0x4000010CU) //!< (HSMCI) Transmit Counter Register */
#define REG_HSMCI_RNPR      REG_ACCESS(RwReg, 0x40000110U) //!< (HSMCI) Receive Next Pointer Register */
#define REG_HSMCI_RNCR      REG_ACCESS(RwReg, 0x40000114U) //!< (HSMCI) Receive Next Counter Register */
#define REG_HSMCI_TNPR      REG_ACCESS(RwReg, 0x40000118U) //!< (HSMCI) Transmit Next Pointer Register */
#define REG_HSMCI_TNCR      REG_ACCESS(RwReg, 0x4000011CU) //!< (HSMCI) Transmit Next Counter Register */
#define REG_HSMCI_PTCR      REG_ACCESS(WoReg, 0x40000120U) //!< (HSMCI) Transfer Control Register */
#define REG_HSMCI_PTSR      REG_ACCESS(RoReg, 0x40000124U) //!< (HSMCI) Transfer Status Register */
#define REG_HSMCI_FIFO      REG_ACCESS(RwReg, 0x40000200U) //!< (HSMCI) FIFO Memory Aperture0 */

/* ========== Register definition for SSC peripheral ========== */
#define REG_SSC_CR          REG_ACCESS(WoReg, 0x40004000U) //!< (SSC) Control Register
#define REG_SSC_CMR         REG_ACCESS(RwReg, 0x40004004U) //!< (SSC) Clock Mode Register
#define REG_SSC_RCMR        REG_ACCESS(RwReg, 0x40004010U) //!< (SSC) Receive Clock Mode Register
#define REG_SSC_RFMR        REG_ACCESS(RwReg, 0x40004014U) //!< (SSC) Receive Frame Mode Register
#define REG_SSC_TCMR        REG_ACCESS(RwReg, 0x40004018U) //!< (SSC) Transmit Clock Mode Register
#define REG_SSC_TFMR        REG_ACCESS(RwReg, 0x4000401CU) //!< (SSC) Transmit Frame Mode Register
#define REG_SSC_RHR         REG_ACCESS(RoReg, 0x40004020U) //!< (SSC) Receive Holding Register
#define REG_SSC_THR         REG_ACCESS(WoReg, 0x40004024U) //!< (SSC) Transmit Holding Register
#define REG_SSC_RSHR        REG_ACCESS(RoReg, 0x40004030U) //!< (SSC) Receive Sync. Holding Register
#define REG_SSC_TSHR        REG_ACCESS(RwReg, 0x40004034U) //!< (SSC) Transmit Sync. Holding Register
#define REG_SSC_RC0R        REG_ACCESS(RwReg, 0x40004038U) //!< (SSC) Receive Compare 0 Register
#define REG_SSC_RC1R        REG_ACCESS(RwReg, 0x4000403CU) //!< (SSC) Receive Compare 1 Register
#define REG_SSC_SR          REG_ACCESS(RoReg, 0x40004040U) //!< (SSC) Status Register
#define REG_SSC_IER         REG_ACCESS(WoReg, 0x40004044U) //!< (SSC) Interrupt Enable Register
#define REG_SSC_IDR         REG_ACCESS(WoReg, 0x40004048U) //!< (SSC) Interrupt Disable Register
#define REG_SSC_IMR         REG_ACCESS(RoReg, 0x4000404CU) //!< (SSC) Interrupt Mask Register
#define REG_SSC_WPMR        REG_ACCESS(RwReg, 0x400040E4U) //!< (SSC) Write Protect Mode Register
#define REG_SSC_WPSR        REG_ACCESS(RoReg, 0x400040E8U) //!< (SSC) Write Protect Status Register
#define REG_SSC_RPR         REG_ACCESS(RwReg, 0x40004100U) //!< (SSC) Receive Pointer Register
#define REG_SSC_RCR         REG_ACCESS(RwReg, 0x40004104U) //!< (SSC) Receive Counter Register
#define REG_SSC_TPR         REG_ACCESS(RwReg, 0x40004108U) //!< (SSC) Transmit Pointer Register
#define REG_SSC_TCR         REG_ACCESS(RwReg, 0x4000410CU) //!< (SSC) Transmit Counter Register
#define REG_SSC_RNPR        REG_ACCESS(RwReg, 0x40004110U) //!< (SSC) Receive Next Pointer Register
#define REG_SSC_RNCR        REG_ACCESS(RwReg, 0x40004114U) //!< (SSC) Receive Next Counter Register
#define REG_SSC_TNPR        REG_ACCESS(RwReg, 0x40004118U) //!< (SSC) Transmit Next Pointer Register
#define REG_SSC_TNCR        REG_ACCESS(RwReg, 0x4000411CU) //!< (SSC) Transmit Next Counter Register
#define REG_SSC_PTCR        REG_ACCESS(WoReg, 0x40004120U) //!< (SSC) Transfer Control Register
#define REG_SSC_PTSR        REG_ACCESS(RoReg, 0x40004124U) //!< (SSC) Transfer Status Register

/* ========== Register definition for SPI peripheral ========== */
#define REG_SPI_CR          REG_ACCESS(WoReg, 0x40008000U) //!< (SPI) Control Register */
#define REG_SPI_MR          REG_ACCESS(RwReg, 0x40008004U) //!< (SPI) Mode Register */
#define REG_SPI_RDR         REG_ACCESS(RoReg, 0x40008008U) //!< (SPI) Receive Data Register */
#define REG_SPI_TDR         REG_ACCESS(WoReg, 0x4000800CU) //!< (SPI) Transmit Data Register */
#define REG_SPI_SR          REG_ACCESS(RoReg, 0x40008010U) //!< (SPI) Status Register */
#define REG_SPI_IER         REG_ACCESS(WoReg, 0x40008014U) //!< (SPI) Interrupt Enable Register */
#define REG_SPI_IDR         REG_ACCESS(WoReg, 0x40008018U) //!< (SPI) Interrupt Disable Register */
#define REG_SPI_IMR         REG_ACCESS(RoReg, 0x4000801CU) //!< (SPI) Interrupt Mask Register */
#define REG_SPI_CSR         REG_ACCESS(RwReg, 0x40008030U) //!< (SPI) Chip Select Register */
#define REG_SPI_WPMR        REG_ACCESS(RwReg, 0x400080E4U) //!< (SPI) Write Protection Control Register */
#define REG_SPI_WPSR        REG_ACCESS(RoReg, 0x400080E8U) //!< (SPI) Write Protection Status Register */
#define REG_SPI_RPR         REG_ACCESS(RwReg, 0x40008100U) //!< (SPI) Receive Pointer Register */
#define REG_SPI_RCR         REG_ACCESS(RwReg, 0x40008104U) //!< (SPI) Receive Counter Register */
#define REG_SPI_TPR         REG_ACCESS(RwReg, 0x40008108U) //!< (SPI) Transmit Pointer Register */
#define REG_SPI_TCR         REG_ACCESS(RwReg, 0x4000810CU) //!< (SPI) Transmit Counter Register */
#define REG_SPI_RNPR        REG_ACCESS(RwReg, 0x40008110U) //!< (SPI) Receive Next Pointer Register */
#define REG_SPI_RNCR        REG_ACCESS(RwReg, 0x40008114U) //!< (SPI) Receive Next Counter Register */
#define REG_SPI_TNPR        REG_ACCESS(RwReg, 0x40008118U) //!< (SPI) Transmit Next Pointer Register */
#define REG_SPI_TNCR        REG_ACCESS(RwReg, 0x4000811CU) //!< (SPI) Transmit Next Counter Register */
#define REG_SPI_PTCR        REG_ACCESS(WoReg, 0x40008120U) //!< (SPI) Transfer Control Register */
#define REG_SPI_PTSR        REG_ACCESS(RoReg, 0x40008124U) //!< (SPI) Transfer Status Register */

