miro-kostadinov/tmos/tags/tmos/5.02.1.0/hardware/at91/cortex-m3/sam3s/series_map.h
/* ========== Register definition for TC0 peripheral ========== */
#define REG_TC0_CCR0        REG_ACCESS(WoReg, 0x40010000U) //!< (TC0) Channel Control Register (channel = 0) */
#define REG_TC0_CMR0        REG_ACCESS(RwReg, 0x40010004U) //!< (TC0) Channel Mode Register (channel = 0) */
#define REG_TC0_SMMR0       REG_ACCESS(RwReg, 0x40010008U) //!< (TC0) Stepper Motor Mode Register (channel = 0) */
#define REG_TC0_CV0         REG_ACCESS(RoReg, 0x40010010U) //!< (TC0) Counter Value (channel = 0) */
#define REG_TC0_RA0         REG_ACCESS(RwReg, 0x40010014U) //!< (TC0) Register A (channel = 0) */
#define REG_TC0_RB0         REG_ACCESS(RwReg, 0x40010018U) //!< (TC0) Register B (channel = 0) */
#define REG_TC0_RC0         REG_ACCESS(RwReg, 0x4001001CU) //!< (TC0) Register C (channel = 0) */
#define REG_TC0_SR0         REG_ACCESS(RoReg, 0x40010020U) //!< (TC0) Status Register (channel = 0) */
#define REG_TC0_IER0        REG_ACCESS(WoReg, 0x40010024U) //!< (TC0) Interrupt Enable Register (channel = 0) */
#define REG_TC0_IDR0        REG_ACCESS(WoReg, 0x40010028U) //!< (TC0) Interrupt Disable Register (channel = 0) */
#define REG_TC0_IMR0        REG_ACCESS(RoReg, 0x4001002CU) //!< (TC0) Interrupt Mask Register (channel = 0) */
#define REG_TC0_CCR1        REG_ACCESS(WoReg, 0x40010040U) //!< (TC0) Channel Control Register (channel = 1) */
#define REG_TC0_CMR1        REG_ACCESS(RwReg, 0x40010044U) //!< (TC0) Channel Mode Register (channel = 1) */
#define REG_TC0_SMMR1       REG_ACCESS(RwReg, 0x40010048U) //!< (TC0) Stepper Motor Mode Register (channel = 1) */
#define REG_TC0_CV1         REG_ACCESS(RoReg, 0x40010050U) //!< (TC0) Counter Value (channel = 1) */
#define REG_TC0_RA1         REG_ACCESS(RwReg, 0x40010054U) //!< (TC0) Register A (channel = 1) */
#define REG_TC0_RB1         REG_ACCESS(RwReg, 0x40010058U) //!< (TC0) Register B (channel = 1) */
#define REG_TC0_RC1         REG_ACCESS(RwReg, 0x4001005CU) //!< (TC0) Register C (channel = 1) */
#define REG_TC0_SR1         REG_ACCESS(RoReg, 0x40010060U) //!< (TC0) Status Register (channel = 1) */
#define REG_TC0_IER1        REG_ACCESS(WoReg, 0x40010064U) //!< (TC0) Interrupt Enable Register (channel = 1) */
#define REG_TC0_IDR1        REG_ACCESS(WoReg, 0x40010068U) //!< (TC0) Interrupt Disable Register (channel = 1) */
#define REG_TC0_IMR1        REG_ACCESS(RoReg, 0x4001006CU) //!< (TC0) Interrupt Mask Register (channel = 1) */
#define REG_TC0_CCR2        REG_ACCESS(WoReg, 0x40010080U) //!< (TC0) Channel Control Register (channel = 2) */
#define REG_TC0_CMR2        REG_ACCESS(RwReg, 0x40010084U) //!< (TC0) Channel Mode Register (channel = 2) */
#define REG_TC0_SMMR2       REG_ACCESS(RwReg, 0x40010088U) //!< (TC0) Stepper Motor Mode Register (channel = 2) */
#define REG_TC0_CV2         REG_ACCESS(RoReg, 0x40010090U) //!< (TC0) Counter Value (channel = 2) */
#define REG_TC0_RA2         REG_ACCESS(RwReg, 0x40010094U) //!< (TC0) Register A (channel = 2) */
#define REG_TC0_RB2         REG_ACCESS(RwReg, 0x40010098U) //!< (TC0) Register B (channel = 2) */
#define REG_TC0_RC2         REG_ACCESS(RwReg, 0x4001009CU) //!< (TC0) Register C (channel = 2) */
#define REG_TC0_SR2         REG_ACCESS(RoReg, 0x400100A0U) //!< (TC0) Status Register (channel = 2) */
#define REG_TC0_IER2        REG_ACCESS(WoReg, 0x400100A4U) //!< (TC0) Interrupt Enable Register (channel = 2) */
#define REG_TC0_IDR2        REG_ACCESS(WoReg, 0x400100A8U) //!< (TC0) Interrupt Disable Register (channel = 2) */
#define REG_TC0_IMR2        REG_ACCESS(RoReg, 0x400100ACU) //!< (TC0) Interrupt Mask Register (channel = 2) */
#define REG_TC0_BCR         REG_ACCESS(WoReg, 0x400100C0U) //!< (TC0) Block Control Register */
#define REG_TC0_BMR         REG_ACCESS(RwReg, 0x400100C4U) //!< (TC0) Block Mode Register */
#define REG_TC0_QIER        REG_ACCESS(WoReg, 0x400100C8U) //!< (TC0) QDEC Interrupt Enable Register */
#define REG_TC0_QIDR        REG_ACCESS(WoReg, 0x400100CCU) //!< (TC0) QDEC Interrupt Disable Register */
#define REG_TC0_QIMR        REG_ACCESS(RoReg, 0x400100D0U) //!< (TC0) QDEC Interrupt Mask Register */
#define REG_TC0_QISR        REG_ACCESS(RoReg, 0x400100D4U) //!< (TC0) QDEC Interrupt Status Register */
#define REG_TC0_FMR         REG_ACCESS(RwReg, 0x400100D8U) //!< (TC0) Fault Mode Register */
#define REG_TC0_WPMR        REG_ACCESS(RwReg, 0x400100E4U) //!< (TC0) Write Protect Mode Register */
/* ========== Register definition for TC1 peripheral ========== */
#define REG_TC1_CCR0        REG_ACCESS(WoReg, 0x40014000U) //!< (TC1) Channel Control Register (channel = 0) */
#define REG_TC1_CMR0        REG_ACCESS(RwReg, 0x40014004U) //!< (TC1) Channel Mode Register (channel = 0) */
#define REG_TC1_SMMR0       REG_ACCESS(RwReg, 0x40014008U) //!< (TC1) Stepper Motor Mode Register (channel = 0) */
#define REG_TC1_CV0         REG_ACCESS(RoReg, 0x40014010U) //!< (TC1) Counter Value (channel = 0) */
#define REG_TC1_RA0         REG_ACCESS(RwReg, 0x40014014U) //!< (TC1) Register A (channel = 0) */
#define REG_TC1_RB0         REG_ACCESS(RwReg, 0x40014018U) //!< (TC1) Register B (channel = 0) */
#define REG_TC1_RC0         REG_ACCESS(RwReg, 0x4001401CU) //!< (TC1) Register C (channel = 0) */
#define REG_TC1_SR0         REG_ACCESS(RoReg, 0x40014020U) //!< (TC1) Status Register (channel = 0) */
#define REG_TC1_IER0        REG_ACCESS(WoReg, 0x40014024U) //!< (TC1) Interrupt Enable Register (channel = 0) */
#define REG_TC1_IDR0        REG_ACCESS(WoReg, 0x40014028U) //!< (TC1) Interrupt Disable Register (channel = 0) */
#define REG_TC1_IMR0        REG_ACCESS(RoReg, 0x4001402CU) //!< (TC1) Interrupt Mask Register (channel = 0) */
#define REG_TC1_CCR1        REG_ACCESS(WoReg, 0x40014040U) //!< (TC1) Channel Control Register (channel = 1) */
#define REG_TC1_CMR1        REG_ACCESS(RwReg, 0x40014044U) //!< (TC1) Channel Mode Register (channel = 1) */
#define REG_TC1_SMMR1       REG_ACCESS(RwReg, 0x40014048U) //!< (TC1) Stepper Motor Mode Register (channel = 1) */
#define REG_TC1_CV1         REG_ACCESS(RoReg, 0x40014050U) //!< (TC1) Counter Value (channel = 1) */
#define REG_TC1_RA1         REG_ACCESS(RwReg, 0x40014054U) //!< (TC1) Register A (channel = 1) */
#define REG_TC1_RB1         REG_ACCESS(RwReg, 0x40014058U) //!< (TC1) Register B (channel = 1) */
#define REG_TC1_RC1         REG_ACCESS(RwReg, 0x4001405CU) //!< (TC1) Register C (channel = 1) */
#define REG_TC1_SR1         REG_ACCESS(RoReg, 0x40014060U) //!< (TC1) Status Register (channel = 1) */
#define REG_TC1_IER1        REG_ACCESS(WoReg, 0x40014064U) //!< (TC1) Interrupt Enable Register (channel = 1) */
#define REG_TC1_IDR1        REG_ACCESS(WoReg, 0x40014068U) //!< (TC1) Interrupt Disable Register (channel = 1) */
#define REG_TC1_IMR1        REG_ACCESS(RoReg, 0x4001406CU) //!< (TC1) Interrupt Mask Register (channel = 1) */
#define REG_TC1_CCR2        REG_ACCESS(WoReg, 0x40014080U) //!< (TC1) Channel Control Register (channel = 2) */
#define REG_TC1_CMR2        REG_ACCESS(RwReg, 0x40014084U) //!< (TC1) Channel Mode Register (channel = 2) */
#define REG_TC1_SMMR2       REG_ACCESS(RwReg, 0x40014088U) //!< (TC1) Stepper Motor Mode Register (channel = 2) */
#define REG_TC1_CV2         REG_ACCESS(RoReg, 0x40014090U) //!< (TC1) Counter Value (channel = 2) */
#define REG_TC1_RA2         REG_ACCESS(RwReg, 0x40014094U) //!< (TC1) Register A (channel = 2) */
#define REG_TC1_RB2         REG_ACCESS(RwReg, 0x40014098U) //!< (TC1) Register B (channel = 2) */
#define REG_TC1_RC2         REG_ACCESS(RwReg, 0x4001409CU) //!< (TC1) Register C (channel = 2) */
#define REG_TC1_SR2         REG_ACCESS(RoReg, 0x400140A0U) //!< (TC1) Status Register (channel = 2) */
#define REG_TC1_IER2        REG_ACCESS(WoReg, 0x400140A4U) //!< (TC1) Interrupt Enable Register (channel = 2) */
#define REG_TC1_IDR2        REG_ACCESS(WoReg, 0x400140A8U) //!< (TC1) Interrupt Disable Register (channel = 2) */
#define REG_TC1_IMR2        REG_ACCESS(RoReg, 0x400140ACU) //!< (TC1) Interrupt Mask Register (channel = 2) */
#define REG_TC1_BCR         REG_ACCESS(WoReg, 0x400140C0U) //!< (TC1) Block Control Register */
#define REG_TC1_BMR         REG_ACCESS(RwReg, 0x400140C4U) //!< (TC1) Block Mode Register */
#define REG_TC1_QIER        REG_ACCESS(WoReg, 0x400140C8U) //!< (TC1) QDEC Interrupt Enable Register */
#define REG_TC1_QIDR        REG_ACCESS(WoReg, 0x400140CCU) //!< (TC1) QDEC Interrupt Disable Register */
#define REG_TC1_QIMR        REG_ACCESS(RoReg, 0x400140D0U) //!< (TC1) QDEC Interrupt Mask Register */
#define REG_TC1_QISR        REG_ACCESS(RoReg, 0x400140D4U) //!< (TC1) QDEC Interrupt Status Register */
#define REG_TC1_FMR         REG_ACCESS(RwReg, 0x400140D8U) //!< (TC1) Fault Mode Register */
#define REG_TC1_WPMR        REG_ACCESS(RwReg, 0x400140E4U) //!< (TC1) Write Protect Mode Register */
/* ========== Register definition for TWI0 peripheral ========== */
#define REG_TWI0_CR         REG_ACCESS(WoReg, 0x40018000U) //!< (TWI0) Control Register */
#define REG_TWI0_MMR        REG_ACCESS(RwReg, 0x40018004U) //!< (TWI0) Master Mode Register */
#define REG_TWI0_SMR        REG_ACCESS(RwReg, 0x40018008U) //!< (TWI0) Slave Mode Register */
#define REG_TWI0_IADR       REG_ACCESS(RwReg, 0x4001800CU) //!< (TWI0) Internal Address Register */
#define REG_TWI0_CWGR       REG_ACCESS(RwReg, 0x40018010U) //!< (TWI0) Clock Waveform Generator Register */
#define REG_TWI0_SR         REG_ACCESS(RoReg, 0x40018020U) //!< (TWI0) Status Register */
#define REG_TWI0_IER        REG_ACCESS(WoReg, 0x40018024U) //!< (TWI0) Interrupt Enable Register */
#define REG_TWI0_IDR        REG_ACCESS(WoReg, 0x40018028U) //!< (TWI0) Interrupt Disable Register */
#define REG_TWI0_IMR        REG_ACCESS(RoReg, 0x4001802CU) //!< (TWI0) Interrupt Mask Register */
#define REG_TWI0_RHR        REG_ACCESS(RoReg, 0x40018030U) //!< (TWI0) Receive Holding Register */
#define REG_TWI0_THR        REG_ACCESS(WoReg, 0x40018034U) //!< (TWI0) Transmit Holding Register */
#define REG_TWI0_RPR        REG_ACCESS(RwReg, 0x40018100U) //!< (TWI0) Receive Pointer Register */
#define REG_TWI0_RCR        REG_ACCESS(RwReg, 0x40018104U) //!< (TWI0) Receive Counter Register */
#define REG_TWI0_TPR        REG_ACCESS(RwReg, 0x40018108U) //!< (TWI0) Transmit Pointer Register */
#define REG_TWI0_TCR        REG_ACCESS(RwReg, 0x4001810CU) //!< (TWI0) Transmit Counter Register */
#define REG_TWI0_RNPR       REG_ACCESS(RwReg, 0x40018110U) //!< (TWI0) Receive Next Pointer Register */
#define REG_TWI0_RNCR       REG_ACCESS(RwReg, 0x40018114U) //!< (TWI0) Receive Next Counter Register */
#define REG_TWI0_TNPR       REG_ACCESS(RwReg, 0x40018118U) //!< (TWI0) Transmit Next Pointer Register */
#define REG_TWI0_TNCR       REG_ACCESS(RwReg, 0x4001811CU) //!< (TWI0) Transmit Next Counter Register */
#define REG_TWI0_PTCR       REG_ACCESS(WoReg, 0x40018120U) //!< (TWI0) Transfer Control Register */
#define REG_TWI0_PTSR       REG_ACCESS(RoReg, 0x40018124U) //!< (TWI0) Transfer Status Register */
/* ========== Register definition for TWI1 peripheral ========== */
#define REG_TWI1_CR         REG_ACCESS(WoReg, 0x4001C000U) //!< (TWI1) Control Register */
#define REG_TWI1_MMR        REG_ACCESS(RwReg, 0x4001C004U) //!< (TWI1) Master Mode Register */
#define REG_TWI1_SMR        REG_ACCESS(RwReg, 0x4001C008U) //!< (TWI1) Slave Mode Register */
#define REG_TWI1_IADR       REG_ACCESS(RwReg, 0x4001C00CU) //!< (TWI1) Internal Address Register */
#define REG_TWI1_CWGR       REG_ACCESS(RwReg, 0x4001C010U) //!< (TWI1) Clock Waveform Generator Register */
#define REG_TWI1_SR         REG_ACCESS(RoReg, 0x4001C020U) //!< (TWI1) Status Register */
#define REG_TWI1_IER        REG_ACCESS(WoReg, 0x4001C024U) //!< (TWI1) Interrupt Enable Register */
#define REG_TWI1_IDR        REG_ACCESS(WoReg, 0x4001C028U) //!< (TWI1) Interrupt Disable Register */
#define REG_TWI1_IMR        REG_ACCESS(RoReg, 0x4001C02CU) //!< (TWI1) Interrupt Mask Register */
#define REG_TWI1_RHR        REG_ACCESS(RoReg, 0x4001C030U) //!< (TWI1) Receive Holding Register */
#define REG_TWI1_THR        REG_ACCESS(WoReg, 0x4001C034U) //!< (TWI1) Transmit Holding Register */
#define REG_TWI1_RPR        REG_ACCESS(RwReg, 0x4001C100U) //!< (TWI1) Receive Pointer Register */
#define REG_TWI1_RCR        REG_ACCESS(RwReg, 0x4001C104U) //!< (TWI1) Receive Counter Register */
#define REG_TWI1_TPR        REG_ACCESS(RwReg, 0x4001C108U) //!< (TWI1) Transmit Pointer Register */
#define REG_TWI1_TCR        REG_ACCESS(RwReg, 0x4001C10CU) //!< (TWI1) Transmit Counter Register */
#define REG_TWI1_RNPR       REG_ACCESS(RwReg, 0x4001C110U) //!< (TWI1) Receive Next Pointer Register */
#define REG_TWI1_RNCR       REG_ACCESS(RwReg, 0x4001C114U) //!< (TWI1) Receive Next Counter Register */
#define REG_TWI1_TNPR       REG_ACCESS(RwReg, 0x4001C118U) //!< (TWI1) Transmit Next Pointer Register */
#define REG_TWI1_TNCR       REG_ACCESS(RwReg, 0x4001C11CU) //!< (TWI1) Transmit Next Counter Register */
#define REG_TWI1_PTCR       REG_ACCESS(WoReg, 0x4001C120U) //!< (TWI1) Transfer Control Register */
#define REG_TWI1_PTSR       REG_ACCESS(RoReg, 0x4001C124U) //!< (TWI1) Transfer Status Register */
/* ========== Register definition for PWM peripheral ========== */
#define REG_PWM_CLK         REG_ACCESS(RwReg, 0x40020000U) //!< (PWM) PWM Clock Register */
#define REG_PWM_ENA         REG_ACCESS(WoReg, 0x40020004U) //!< (PWM) PWM Enable Register */
#define REG_PWM_DIS         REG_ACCESS(WoReg, 0x40020008U) //!< (PWM) PWM Disable Register */
#define REG_PWM_SR          REG_ACCESS(RoReg, 0x4002000CU) //!< (PWM) PWM Status Register */
#define REG_PWM_IER1        REG_ACCESS(WoReg, 0x40020010U) //!< (PWM) PWM Interrupt Enable Register 1 */
#define REG_PWM_IDR1        REG_ACCESS(WoReg, 0x40020014U) //!< (PWM) PWM Interrupt Disable Register 1 */
#define REG_PWM_IMR1        REG_ACCESS(RoReg, 0x40020018U) //!< (PWM) PWM Interrupt Mask Register 1 */
#define REG_PWM_ISR1        REG_ACCESS(RoReg, 0x4002001CU) //!< (PWM) PWM Interrupt Status Register 1 */
#define REG_PWM_SCM         REG_ACCESS(RwReg, 0x40020020U) //!< (PWM) PWM Sync Channels Mode Register */
#define REG_PWM_SCUC        REG_ACCESS(RwReg, 0x40020028U) //!< (PWM) PWM Sync Channels Update Control Register */
#define REG_PWM_SCUP        REG_ACCESS(RwReg, 0x4002002CU) //!< (PWM) PWM Sync Channels Update Period Register */
#define REG_PWM_SCUPUPD     REG_ACCESS(WoReg, 0x40020030U) //!< (PWM) PWM Sync Channels Update Period Update Register */
#define REG_PWM_IER2        REG_ACCESS(WoReg, 0x40020034U) //!< (PWM) PWM Interrupt Enable Register 2 */
#define REG_PWM_IDR2        REG_ACCESS(WoReg, 0x40020038U) //!< (PWM) PWM Interrupt Disable Register 2 */
#define REG_PWM_IMR2        REG_ACCESS(RoReg, 0x4002003CU) //!< (PWM) PWM Interrupt Mask Register 2 */
#define REG_PWM_ISR2        REG_ACCESS(RoReg, 0x40020040U) //!< (PWM) PWM Interrupt Status Register 2 */
#define REG_PWM_OOV         REG_ACCESS(RwReg, 0x40020044U) //!< (PWM) PWM Output Override Value Register */
#define REG_PWM_OS          REG_ACCESS(RwReg, 0x40020048U) //!< (PWM) PWM Output Selection Register */
#define REG_PWM_OSS         REG_ACCESS(WoReg, 0x4002004CU) //!< (PWM) PWM Output Selection Set Register */
#define REG_PWM_OSC         REG_ACCESS(WoReg, 0x40020050U) //!< (PWM) PWM Output Selection Clear Register */
#define REG_PWM_OSSUPD      REG_ACCESS(WoReg, 0x40020054U) //!< (PWM) PWM Output Selection Set Update Register */
#define REG_PWM_OSCUPD      REG_ACCESS(WoReg, 0x40020058U) //!< (PWM) PWM Output Selection Clear Update Register */
#define REG_PWM_FMR         REG_ACCESS(RwReg, 0x4002005CU) //!< (PWM) PWM Fault Mode Register */
#define REG_PWM_FSR         REG_ACCESS(RoReg, 0x40020060U) //!< (PWM) PWM Fault Status Register */
#define REG_PWM_FCR         REG_ACCESS(WoReg, 0x40020064U) //!< (PWM) PWM Fault Clear Register */
#define REG_PWM_FPV         REG_ACCESS(RwReg, 0x40020068U) //!< (PWM) PWM Fault Protection Value Register */
#define REG_PWM_FPE         REG_ACCESS(RwReg, 0x4002006CU) //!< (PWM) PWM Fault Protection Enable Register */
#define REG_PWM_EL0MR       REG_ACCESS(RwReg, 0x4002007CU) //!< (PWM) PWM Event Line 0 Mode Register */
#define REG_PWM_EL1MR       REG_ACCESS(RwReg, 0x40020080U) //!< (PWM) PWM Event Line 1 Mode Register */
#define REG_PWM_SMMR        REG_ACCESS(RwReg, 0x400200B0U) //!< (PWM) PWM Stepper Motor Mode Register */
#define REG_PWM_WPCR        REG_ACCESS(WoReg, 0x400200E4U) //!< (PWM) PWM Write Protect Control Register */
#define REG_PWM_WPSR        REG_ACCESS(RoReg, 0x400200E8U) //!< (PWM) PWM Write Protect Status Register */
#define REG_PWM_RPR         REG_ACCESS(RwReg, 0x40020100U) //!< (PWM) Receive Pointer Register */
#define REG_PWM_RCR         REG_ACCESS(RwReg, 0x40020104U) //!< (PWM) Receive Counter Register */
#define REG_PWM_TPR         REG_ACCESS(RwReg, 0x40020108U) //!< (PWM) Transmit Pointer Register */
#define REG_PWM_TCR         REG_ACCESS(RwReg, 0x4002010CU) //!< (PWM) Transmit Counter Register */
#define REG_PWM_RNPR        REG_ACCESS(RwReg, 0x40020110U) //!< (PWM) Receive Next Pointer Register */
#define REG_PWM_RNCR        REG_ACCESS(RwReg, 0x40020114U) //!< (PWM) Receive Next Counter Register */
#define REG_PWM_TNPR        REG_ACCESS(RwReg, 0x40020118U) //!< (PWM) Transmit Next Pointer Register */
#define REG_PWM_TNCR        REG_ACCESS(RwReg, 0x4002011CU) //!< (PWM) Transmit Next Counter Register */
#define REG_PWM_PTCR        REG_ACCESS(WoReg, 0x40020120U) //!< (PWM) Transfer Control Register */
#define REG_PWM_PTSR        REG_ACCESS(RoReg, 0x40020124U) //!< (PWM) Transfer Status Register */
#define REG_PWM_CMP0V       REG_ACCESS(RwReg, 0x40020130U) //!< (PWM) PWM Comparison 0 Value Register */
#define REG_PWM_CMP0VUPD    REG_ACCESS(WoReg, 0x40020134U) //!< (PWM) PWM Comparison 0 Value Update Register */
#define REG_PWM_CMP0M       REG_ACCESS(RwReg, 0x40020138U) //!< (PWM) PWM Comparison 0 Mode Register */
#define REG_PWM_CMP0MUPD    REG_ACCESS(WoReg, 0x4002013CU) //!< (PWM) PWM Comparison 0 Mode Update Register */
#define REG_PWM_CMP1V       REG_ACCESS(RwReg, 0x40020140U) //!< (PWM) PWM Comparison 1 Value Register */
#define REG_PWM_CMP1VUPD    REG_ACCESS(WoReg, 0x40020144U) //!< (PWM) PWM Comparison 1 Value Update Register */
#define REG_PWM_CMP1M       REG_ACCESS(RwReg, 0x40020148U) //!< (PWM) PWM Comparison 1 Mode Register */
#define REG_PWM_CMP1MUPD    REG_ACCESS(WoReg, 0x4002014CU) //!< (PWM) PWM Comparison 1 Mode Update Register */
#define REG_PWM_CMP2V       REG_ACCESS(RwReg, 0x40020150U) //!< (PWM) PWM Comparison 2 Value Register */
#define REG_PWM_CMP2VUPD    REG_ACCESS(WoReg, 0x40020154U) //!< (PWM) PWM Comparison 2 Value Update Register */
#define REG_PWM_CMP2M       REG_ACCESS(RwReg, 0x40020158U) //!< (PWM) PWM Comparison 2 Mode Register */
#define REG_PWM_CMP2MUPD    REG_ACCESS(WoReg, 0x4002015CU) //!< (PWM) PWM Comparison 2 Mode Update Register */
#define REG_PWM_CMP3V       REG_ACCESS(RwReg, 0x40020160U) //!< (PWM) PWM Comparison 3 Value Register */
#define REG_PWM_CMP3VUPD    REG_ACCESS(WoReg, 0x40020164U) //!< (PWM) PWM Comparison 3 Value Update Register */
#define REG_PWM_CMP3M       REG_ACCESS(RwReg, 0x40020168U) //!< (PWM) PWM Comparison 3 Mode Register */
#define REG_PWM_CMP3MUPD    REG_ACCESS(WoReg, 0x4002016CU) //!< (PWM) PWM Comparison 3 Mode Update Register */
#define REG_PWM_CMP4V       REG_ACCESS(RwReg, 0x40020170U) //!< (PWM) PWM Comparison 4 Value Register */
#define REG_PWM_CMP4VUPD    REG_ACCESS(WoReg, 0x40020174U) //!< (PWM) PWM Comparison 4 Value Update Register */
#define REG_PWM_CMP4M       REG_ACCESS(RwReg, 0x40020178U) //!< (PWM) PWM Comparison 4 Mode Register */
#define REG_PWM_CMP4MUPD    REG_ACCESS(WoReg, 0x4002017CU) //!< (PWM) PWM Comparison 4 Mode Update Register */
#define REG_PWM_CMP5V       REG_ACCESS(RwReg, 0x40020180U) //!< (PWM) PWM Comparison 5 Value Register */
#define REG_PWM_CMP5VUPD    REG_ACCESS(WoReg, 0x40020184U) //!< (PWM) PWM Comparison 5 Value Update Register */
#define REG_PWM_CMP5M       REG_ACCESS(RwReg, 0x40020188U) //!< (PWM) PWM Comparison 5 Mode Register */
#define REG_PWM_CMP5MUPD    REG_ACCESS(WoReg, 0x4002018CU) //!< (PWM) PWM Comparison 5 Mode Update Register */
#define REG_PWM_CMP6V       REG_ACCESS(RwReg, 0x40020190U) //!< (PWM) PWM Comparison 6 Value Register */
#define REG_PWM_CMP6VUPD    REG_ACCESS(WoReg, 0x40020194U) //!< (PWM) PWM Comparison 6 Value Update Register */
#define REG_PWM_CMP6M       REG_ACCESS(RwReg, 0x40020198U) //!< (PWM) PWM Comparison 6 Mode Register */
#define REG_PWM_CMP6MUPD    REG_ACCESS(WoReg, 0x4002019CU) //!< (PWM) PWM Comparison 6 Mode Update Register */
#define REG_PWM_CMP7V       REG_ACCESS(RwReg, 0x400201A0U) //!< (PWM) PWM Comparison 7 Value Register */
#define REG_PWM_CMP7VUPD    REG_ACCESS(WoReg, 0x400201A4U) //!< (PWM) PWM Comparison 7 Value Update Register */
#define REG_PWM_CMP7M       REG_ACCESS(RwReg, 0x400201A8U) //!< (PWM) PWM Comparison 7 Mode Register */
#define REG_PWM_CMP7MUPD    REG_ACCESS(WoReg, 0x400201ACU) //!< (PWM) PWM Comparison 7 Mode Update Register */
#define REG_PWM_CMR0        REG_ACCESS(RwReg, 0x40020200U) //!< (PWM) PWM Channel Mode Register (ch_num = 0) */
#define REG_PWM_CDTY0       REG_ACCESS(RwReg, 0x40020204U) //!< (PWM) PWM Channel Duty Cycle Register (ch_num = 0) */
#define REG_PWM_CDTYUPD0    REG_ACCESS(WoReg, 0x40020208U) //!< (PWM) PWM Channel Duty Cycle Update Register (ch_num = 0) */
#define REG_PWM_CPRD0       REG_ACCESS(RwReg, 0x4002020CU) //!< (PWM) PWM Channel Period Register (ch_num = 0) */
#define REG_PWM_CPRDUPD0    REG_ACCESS(WoReg, 0x40020210U) //!< (PWM) PWM Channel Period Update Register (ch_num = 0) */
#define REG_PWM_CCNT0       REG_ACCESS(RoReg, 0x40020214U) //!< (PWM) PWM Channel Counter Register (ch_num = 0) */
#define REG_PWM_DT0         REG_ACCESS(RwReg, 0x40020218U) //!< (PWM) PWM Channel Dead Time Register (ch_num = 0) */
#define REG_PWM_DTUPD0      REG_ACCESS(WoReg, 0x4002021CU) //!< (PWM) PWM Channel Dead Time Update Register (ch_num = 0) */
#define REG_PWM_CMR1        REG_ACCESS(RwReg, 0x40020220U) //!< (PWM) PWM Channel Mode Register (ch_num = 1) */
#define REG_PWM_CDTY1       REG_ACCESS(RwReg, 0x40020224U) //!< (PWM) PWM Channel Duty Cycle Register (ch_num = 1) */
#define REG_PWM_CDTYUPD1    REG_ACCESS(WoReg, 0x40020228U) //!< (PWM) PWM Channel Duty Cycle Update Register (ch_num = 1) */
#define REG_PWM_CPRD1       REG_ACCESS(RwReg, 0x4002022CU) //!< (PWM) PWM Channel Period Register (ch_num = 1) */
#define REG_PWM_CPRDUPD1    REG_ACCESS(WoReg, 0x40020230U) //!< (PWM) PWM Channel Period Update Register (ch_num = 1) */
#define REG_PWM_CCNT1       REG_ACCESS(RoReg, 0x40020234U) //!< (PWM) PWM Channel Counter Register (ch_num = 1) */
#define REG_PWM_DT1         REG_ACCESS(RwReg, 0x40020238U) //!< (PWM) PWM Channel Dead Time Register (ch_num = 1) */
#define REG_PWM_DTUPD1      REG_ACCESS(WoReg, 0x4002023CU) //!< (PWM) PWM Channel Dead Time Update Register (ch_num = 1) */
#define REG_PWM_CMR2        REG_ACCESS(RwReg, 0x40020240U) //!< (PWM) PWM Channel Mode Register (ch_num = 2) */
#define REG_PWM_CDTY2       REG_ACCESS(RwReg, 0x40020244U) //!< (PWM) PWM Channel Duty Cycle Register (ch_num = 2) */
#define REG_PWM_CDTYUPD2    REG_ACCESS(WoReg, 0x40020248U) //!< (PWM) PWM Channel Duty Cycle Update Register (ch_num = 2) */
#define REG_PWM_CPRD2       REG_ACCESS(RwReg, 0x4002024CU) //!< (PWM) PWM Channel Period Register (ch_num = 2) */
#define REG_PWM_CPRDUPD2    REG_ACCESS(WoReg, 0x40020250U) //!< (PWM) PWM Channel Period Update Register (ch_num = 2) */
#define REG_PWM_CCNT2       REG_ACCESS(RoReg, 0x40020254U) //!< (PWM) PWM Channel Counter Register (ch_num = 2) */
#define REG_PWM_DT2         REG_ACCESS(RwReg, 0x40020258U) //!< (PWM) PWM Channel Dead Time Register (ch_num = 2) */
