miro-kostadinov/tmos/tags/tmos/5.02.1.0/hardware/at91/cortex-m3/sam3s/series_map.h
#define REG_PWM_DTUPD2      REG_ACCESS(WoReg, 0x4002025CU) //!< (PWM) PWM Channel Dead Time Update Register (ch_num = 2) */
#define REG_PWM_CMR3        REG_ACCESS(RwReg, 0x40020260U) //!< (PWM) PWM Channel Mode Register (ch_num = 3) */
#define REG_PWM_CDTY3       REG_ACCESS(RwReg, 0x40020264U) //!< (PWM) PWM Channel Duty Cycle Register (ch_num = 3) */
#define REG_PWM_CDTYUPD3    REG_ACCESS(WoReg, 0x40020268U) //!< (PWM) PWM Channel Duty Cycle Update Register (ch_num = 3) */
#define REG_PWM_CPRD3       REG_ACCESS(RwReg, 0x4002026CU) //!< (PWM) PWM Channel Period Register (ch_num = 3) */
#define REG_PWM_CPRDUPD3    REG_ACCESS(WoReg, 0x40020270U) //!< (PWM) PWM Channel Period Update Register (ch_num = 3) */
#define REG_PWM_CCNT3       REG_ACCESS(RoReg, 0x40020274U) //!< (PWM) PWM Channel Counter Register (ch_num = 3) */
#define REG_PWM_DT3         REG_ACCESS(RwReg, 0x40020278U) //!< (PWM) PWM Channel Dead Time Register (ch_num = 3) */
#define REG_PWM_DTUPD3      REG_ACCESS(WoReg, 0x4002027CU) //!< (PWM) PWM Channel Dead Time Update Register (ch_num = 3) */
/* ========== Register definition for USART0 peripheral ========== */
#define REG_USART0_CR       REG_ACCESS(WoReg, 0x40024000U) //!< (USART0) Control Register */
#define REG_USART0_MR       REG_ACCESS(RwReg, 0x40024004U) //!< (USART0) Mode Register */
#define REG_USART0_IER      REG_ACCESS(WoReg, 0x40024008U) //!< (USART0) Interrupt Enable Register */
#define REG_USART0_IDR      REG_ACCESS(WoReg, 0x4002400CU) //!< (USART0) Interrupt Disable Register */
#define REG_USART0_IMR      REG_ACCESS(RoReg, 0x40024010U) //!< (USART0) Interrupt Mask Register */
#define REG_USART0_CSR      REG_ACCESS(RoReg, 0x40024014U) //!< (USART0) Channel Status Register */
#define REG_USART0_RHR      REG_ACCESS(RoReg, 0x40024018U) //!< (USART0) Receiver Holding Register */
#define REG_USART0_THR      REG_ACCESS(WoReg, 0x4002401CU) //!< (USART0) Transmitter Holding Register */
#define REG_USART0_BRGR     REG_ACCESS(RwReg, 0x40024020U) //!< (USART0) Baud Rate Generator Register */
#define REG_USART0_RTOR     REG_ACCESS(RwReg, 0x40024024U) //!< (USART0) Receiver Time-out Register */
#define REG_USART0_TTGR     REG_ACCESS(RwReg, 0x40024028U) //!< (USART0) Transmitter Timeguard Register */
#define REG_USART0_FIDI     REG_ACCESS(RwReg, 0x40024040U) //!< (USART0) FI DI Ratio Register */
#define REG_USART0_NER      REG_ACCESS(RoReg, 0x40024044U) //!< (USART0) Number of Errors Register */
#define REG_USART0_IF       REG_ACCESS(RwReg, 0x4002404CU) //!< (USART0) IrDA Filter Register */
#define REG_USART0_MAN      REG_ACCESS(RwReg, 0x40024050U) //!< (USART0) Manchester Encoder Decoder Register */
#define REG_USART0_WPMR     REG_ACCESS(RwReg, 0x400240E4U) //!< (USART0) Write Protect Mode Register */
#define REG_USART0_WPSR     REG_ACCESS(RoReg, 0x400240E8U) //!< (USART0) Write Protect Status Register */
#define REG_USART0_RPR      REG_ACCESS(RwReg, 0x40024100U) //!< (USART0) Receive Pointer Register */
#define REG_USART0_RCR      REG_ACCESS(RwReg, 0x40024104U) //!< (USART0) Receive Counter Register */
#define REG_USART0_TPR      REG_ACCESS(RwReg, 0x40024108U) //!< (USART0) Transmit Pointer Register */
#define REG_USART0_TCR      REG_ACCESS(RwReg, 0x4002410CU) //!< (USART0) Transmit Counter Register */
#define REG_USART0_RNPR     REG_ACCESS(RwReg, 0x40024110U) //!< (USART0) Receive Next Pointer Register */
#define REG_USART0_RNCR     REG_ACCESS(RwReg, 0x40024114U) //!< (USART0) Receive Next Counter Register */
#define REG_USART0_TNPR     REG_ACCESS(RwReg, 0x40024118U) //!< (USART0) Transmit Next Pointer Register */
#define REG_USART0_TNCR     REG_ACCESS(RwReg, 0x4002411CU) //!< (USART0) Transmit Next Counter Register */
#define REG_USART0_PTCR     REG_ACCESS(WoReg, 0x40024120U) //!< (USART0) Transfer Control Register */
#define REG_USART0_PTSR     REG_ACCESS(RoReg, 0x40024124U) //!< (USART0) Transfer Status Register */
/* ========== Register definition for USART1 peripheral ========== */
#define REG_USART1_CR       REG_ACCESS(WoReg, 0x40028000U) //!< (USART1) Control Register */
#define REG_USART1_MR       REG_ACCESS(RwReg, 0x40028004U) //!< (USART1) Mode Register */
#define REG_USART1_IER      REG_ACCESS(WoReg, 0x40028008U) //!< (USART1) Interrupt Enable Register */
#define REG_USART1_IDR      REG_ACCESS(WoReg, 0x4002800CU) //!< (USART1) Interrupt Disable Register */
#define REG_USART1_IMR      REG_ACCESS(RoReg, 0x40028010U) //!< (USART1) Interrupt Mask Register */
#define REG_USART1_CSR      REG_ACCESS(RoReg, 0x40028014U) //!< (USART1) Channel Status Register */
#define REG_USART1_RHR      REG_ACCESS(RoReg, 0x40028018U) //!< (USART1) Receiver Holding Register */
#define REG_USART1_THR      REG_ACCESS(WoReg, 0x4002801CU) //!< (USART1) Transmitter Holding Register */
#define REG_USART1_BRGR     REG_ACCESS(RwReg, 0x40028020U) //!< (USART1) Baud Rate Generator Register */
#define REG_USART1_RTOR     REG_ACCESS(RwReg, 0x40028024U) //!< (USART1) Receiver Time-out Register */
#define REG_USART1_TTGR     REG_ACCESS(RwReg, 0x40028028U) //!< (USART1) Transmitter Timeguard Register */
#define REG_USART1_FIDI     REG_ACCESS(RwReg, 0x40028040U) //!< (USART1) FI DI Ratio Register */
#define REG_USART1_NER      REG_ACCESS(RoReg, 0x40028044U) //!< (USART1) Number of Errors Register */
#define REG_USART1_IF       REG_ACCESS(RwReg, 0x4002804CU) //!< (USART1) IrDA Filter Register */
#define REG_USART1_MAN      REG_ACCESS(RwReg, 0x40028050U) //!< (USART1) Manchester Encoder Decoder Register */
#define REG_USART1_WPMR     REG_ACCESS(RwReg, 0x400280E4U) //!< (USART1) Write Protect Mode Register */
#define REG_USART1_WPSR     REG_ACCESS(RoReg, 0x400280E8U) //!< (USART1) Write Protect Status Register */
#define REG_USART1_RPR      REG_ACCESS(RwReg, 0x40028100U) //!< (USART1) Receive Pointer Register */
#define REG_USART1_RCR      REG_ACCESS(RwReg, 0x40028104U) //!< (USART1) Receive Counter Register */
#define REG_USART1_TPR      REG_ACCESS(RwReg, 0x40028108U) //!< (USART1) Transmit Pointer Register */
#define REG_USART1_TCR      REG_ACCESS(RwReg, 0x4002810CU) //!< (USART1) Transmit Counter Register */
#define REG_USART1_RNPR     REG_ACCESS(RwReg, 0x40028110U) //!< (USART1) Receive Next Pointer Register */
#define REG_USART1_RNCR     REG_ACCESS(RwReg, 0x40028114U) //!< (USART1) Receive Next Counter Register */
#define REG_USART1_TNPR     REG_ACCESS(RwReg, 0x40028118U) //!< (USART1) Transmit Next Pointer Register */
#define REG_USART1_TNCR     REG_ACCESS(RwReg, 0x4002811CU) //!< (USART1) Transmit Next Counter Register */
#define REG_USART1_PTCR     REG_ACCESS(WoReg, 0x40028120U) //!< (USART1) Transfer Control Register */
#define REG_USART1_PTSR     REG_ACCESS(RoReg, 0x40028124U) //!< (USART1) Transfer Status Register */

/* ========== Register definition for UDP peripheral ========== */
#define REG_UDP_FRM_NUM     REG_ACCESS(RoReg, 0x40034000U) //!< (UDP) Frame Number Register */
#define REG_UDP_GLB_STAT    REG_ACCESS(RwReg, 0x40034004U) //!< (UDP) Global State Register */
#define REG_UDP_FADDR       REG_ACCESS(RwReg, 0x40034008U) //!< (UDP) Function Address Register */
#define REG_UDP_IER         REG_ACCESS(WoReg, 0x40034010U) //!< (UDP) Interrupt Enable Register */
#define REG_UDP_IDR         REG_ACCESS(WoReg, 0x40034014U) //!< (UDP) Interrupt Disable Register */
#define REG_UDP_IMR         REG_ACCESS(RoReg, 0x40034018U) //!< (UDP) Interrupt Mask Register */
#define REG_UDP_ISR         REG_ACCESS(RoReg, 0x4003401CU) //!< (UDP) Interrupt Status Register */
#define REG_UDP_ICR         REG_ACCESS(WoReg, 0x40034020U) //!< (UDP) Interrupt Clear Register */
#define REG_UDP_RST_EP      REG_ACCESS(RwReg, 0x40034028U) //!< (UDP) Reset Endpoint Register */
#define REG_UDP_CSR         REG_ACCESS(RwReg, 0x40034030U) //!< (UDP) Endpoint Control and Status Register */
#define REG_UDP_FDR         REG_ACCESS(RwReg, 0x40034050U) //!< (UDP) Endpoint FIFO Data Register */
#define REG_UDP_TXVC        REG_ACCESS(RwReg, 0x40034074U) //!< (UDP) Transceiver Control Register */

/* ========== Register definition for ADC peripheral ========== */
#define REG_ADC_CR          REG_ACCESS(WoReg, 0x40038000U) //!< (ADC) Control Register */
#define REG_ADC_MR          REG_ACCESS(RwReg, 0x40038004U) //!< (ADC) Mode Register */
#define REG_ADC_SEQR1       REG_ACCESS(RwReg, 0x40038008U) //!< (ADC) Channel Sequence Register 1 */
#define REG_ADC_SEQR2       REG_ACCESS(RwReg, 0x4003800CU) //!< (ADC) Channel Sequence Register 2 */
#define REG_ADC_CHER        REG_ACCESS(WoReg, 0x40038010U) //!< (ADC) Channel Enable Register */
#define REG_ADC_CHDR        REG_ACCESS(WoReg, 0x40038014U) //!< (ADC) Channel Disable Register */
#define REG_ADC_CHSR        REG_ACCESS(RoReg, 0x40038018U) //!< (ADC) Channel Status Register */
#define REG_ADC_LCDR        REG_ACCESS(RoReg, 0x40038020U) //!< (ADC) Last Converted Data Register */
#define REG_ADC_IER         REG_ACCESS(WoReg, 0x40038024U) //!< (ADC) Interrupt Enable Register */
#define REG_ADC_IDR         REG_ACCESS(WoReg, 0x40038028U) //!< (ADC) Interrupt Disable Register */
#define REG_ADC_IMR         REG_ACCESS(RoReg, 0x4003802CU) //!< (ADC) Interrupt Mask Register */
#define REG_ADC_ISR         REG_ACCESS(RoReg, 0x40038030U) //!< (ADC) Interrupt Status Register */
#define REG_ADC_OVER        REG_ACCESS(RoReg, 0x4003803CU) //!< (ADC) Overrun Status Register */
#define REG_ADC_EMR         REG_ACCESS(RwReg, 0x40038040U) //!< (ADC) Extended Mode Register */
#define REG_ADC_CWR         REG_ACCESS(RwReg, 0x40038044U) //!< (ADC) Compare Window Register */
#define REG_ADC_CGR         REG_ACCESS(RwReg, 0x40038048U) //!< (ADC) Channel Gain Register */
#define REG_ADC_COR         REG_ACCESS(RwReg, 0x4003804CU) //!< (ADC) Channel Offset Register */
#define REG_ADC_CDR         REG_ACCESS(RoReg, 0x40038050U) //!< (ADC) Channel Data Register */
#define REG_ADC_ACR         REG_ACCESS(RwReg, 0x40038094U) //!< (ADC) Analog Control Register */
#define REG_ADC_WPMR        REG_ACCESS(RwReg, 0x400380E4U) //!< (ADC) Write Protect Mode Register */
#define REG_ADC_WPSR        REG_ACCESS(RoReg, 0x400380E8U) //!< (ADC) Write Protect Status Register */
#define REG_ADC_RPR         REG_ACCESS(RwReg, 0x40038100U) //!< (ADC) Receive Pointer Register */
#define REG_ADC_RCR         REG_ACCESS(RwReg, 0x40038104U) //!< (ADC) Receive Counter Register */
#define REG_ADC_TPR         REG_ACCESS(RwReg, 0x40038108U) //!< (ADC) Transmit Pointer Register */
#define REG_ADC_TCR         REG_ACCESS(RwReg, 0x4003810CU) //!< (ADC) Transmit Counter Register */
#define REG_ADC_RNPR        REG_ACCESS(RwReg, 0x40038110U) //!< (ADC) Receive Next Pointer Register */
#define REG_ADC_RNCR        REG_ACCESS(RwReg, 0x40038114U) //!< (ADC) Receive Next Counter Register */
#define REG_ADC_TNPR        REG_ACCESS(RwReg, 0x40038118U) //!< (ADC) Transmit Next Pointer Register */
#define REG_ADC_TNCR        REG_ACCESS(RwReg, 0x4003811CU) //!< (ADC) Transmit Next Counter Register */
#define REG_ADC_PTCR        REG_ACCESS(WoReg, 0x40038120U) //!< (ADC) Transfer Control Register */
#define REG_ADC_PTSR        REG_ACCESS(RoReg, 0x40038124U) //!< (ADC) Transfer Status Register */

/* ========== Register definition for DACC peripheral ========== */
#define REG_DACC_CR         REG_ACCESS(WoReg, 0x4003C000U) //!< (DACC) Control Register
#define REG_DACC_MR         REG_ACCESS(RwReg, 0x4003C004U) //!< (DACC) Mode Register
#define REG_DACC_CHER       REG_ACCESS(WoReg, 0x4003C010U) //!< (DACC) Channel Enable Register
#define REG_DACC_CHDR       REG_ACCESS(WoReg, 0x4003C014U) //!< (DACC) Channel Disable Register
#define REG_DACC_CHSR       REG_ACCESS(RoReg, 0x4003C018U) //!< (DACC) Channel Status Register
#define REG_DACC_CDR        REG_ACCESS(WoReg, 0x4003C020U) //!< (DACC) Conversion Data Register
#define REG_DACC_IER        REG_ACCESS(WoReg, 0x4003C024U) //!< (DACC) Interrupt Enable Register
#define REG_DACC_IDR        REG_ACCESS(WoReg, 0x4003C028U) //!< (DACC) Interrupt Disable Register
#define REG_DACC_IMR        REG_ACCESS(RoReg, 0x4003C02CU) //!< (DACC) Interrupt Mask Register
#define REG_DACC_ISR        REG_ACCESS(RoReg, 0x4003C030U) //!< (DACC) Interrupt Status Register
#define REG_DACC_ACR        REG_ACCESS(RwReg, 0x4003C094U) //!< (DACC) Analog Current Register
#define REG_DACC_WPMR       REG_ACCESS(RwReg, 0x4003C0E4U) //!< (DACC) Write Protect Mode register
#define REG_DACC_WPSR       REG_ACCESS(RoReg, 0x4003C0E8U) //!< (DACC) Write Protect Status register
#define REG_DACC_RPR        REG_ACCESS(RwReg, 0x4003C100U) //!< (DACC) Receive Pointer Register
#define REG_DACC_RCR        REG_ACCESS(RwReg, 0x4003C104U) //!< (DACC) Receive Counter Register
#define REG_DACC_TPR        REG_ACCESS(RwReg, 0x4003C108U) //!< (DACC) Transmit Pointer Register
#define REG_DACC_TCR        REG_ACCESS(RwReg, 0x4003C10CU) //!< (DACC) Transmit Counter Register
#define REG_DACC_RNPR       REG_ACCESS(RwReg, 0x4003C110U) //!< (DACC) Receive Next Pointer Register
#define REG_DACC_RNCR       REG_ACCESS(RwReg, 0x4003C114U) //!< (DACC) Receive Next Counter Register
#define REG_DACC_TNPR       REG_ACCESS(RwReg, 0x4003C118U) //!< (DACC) Transmit Next Pointer Register
#define REG_DACC_TNCR       REG_ACCESS(RwReg, 0x4003C11CU) //!< (DACC) Transmit Next Counter Register
#define REG_DACC_PTCR       REG_ACCESS(WoReg, 0x4003C120U) //!< (DACC) Transfer Control Register
#define REG_DACC_PTSR       REG_ACCESS(RoReg, 0x4003C124U) //!< (DACC) Transfer Status Register

