miro-kostadinov/tmos/tags/tmos/5.02.1.0/hardware/at91/cortex-m3/sam3s/series_map.h
/* ========== Register definition for ACC peripheral ========== */
#define REG_ACC_CR          REG_ACCESS(WoReg, 0x40040000U) //!< (ACC) Control Register */
#define REG_ACC_MR          REG_ACCESS(RwReg, 0x40040004U) //!< (ACC) Mode Register */
#define REG_ACC_IER         REG_ACCESS(WoReg, 0x40040024U) //!< (ACC) Interrupt Enable Register */
#define REG_ACC_IDR         REG_ACCESS(WoReg, 0x40040028U) //!< (ACC) Interrupt Disable Register */
#define REG_ACC_IMR         REG_ACCESS(RoReg, 0x4004002CU) //!< (ACC) Interrupt Mask Register */
#define REG_ACC_ISR         REG_ACCESS(RoReg, 0x40040030U) //!< (ACC) Interrupt Status Register */
#define REG_ACC_ACR         REG_ACCESS(RwReg, 0x40040094U) //!< (ACC) Analog Control Register */
#define REG_ACC_WPMR        REG_ACCESS(RwReg, 0x400400E4U) //!< (ACC) Write Protect Mode Register */
#define REG_ACC_WPSR        REG_ACCESS(RoReg, 0x400400E8U) //!< (ACC) Write Protect Status Register */
/* ========== Register definition for CRCCU peripheral ========== */
#define REG_CRCCU_DSCR      REG_ACCESS(RwReg, 0x40044000U) //!< (CRCCU) CRCCU Descriptor Base Register */
#define REG_CRCCU_DMA_EN    REG_ACCESS(WoReg, 0x40044008U) //!< (CRCCU) CRCCU DMA Enable Register */
#define REG_CRCCU_DMA_DIS   REG_ACCESS(WoReg, 0x4004400CU) //!< (CRCCU) CRCCU DMA Disable Register */
#define REG_CRCCU_DMA_SR    REG_ACCESS(RoReg, 0x40044010U) //!< (CRCCU) CRCCU DMA Status Register */
#define REG_CRCCU_DMA_IER   REG_ACCESS(WoReg, 0x40044014U) //!< (CRCCU) CRCCU DMA Interrupt Enable Register */
#define REG_CRCCU_DMA_IDR   REG_ACCESS(WoReg, 0x40044018U) //!< (CRCCU) CRCCU DMA Interrupt Disable Register */
#define REG_CRCCU_DMA_IMR   REG_ACCESS(RoReg, 0x4004401CU) //!< (CRCCU) CRCCU DMA Interrupt Mask Register */
#define REG_CRCCU_DMA_ISR   REG_ACCESS(RoReg, 0x40044020U) //!< (CRCCU) CRCCU DMA Interrupt Status Register */
#define REG_CRCCU_CR        REG_ACCESS(WoReg, 0x40044034U) //!< (CRCCU) CRCCU Control Register */
#define REG_CRCCU_MR        REG_ACCESS(RwReg, 0x40044038U) //!< (CRCCU) CRCCU Mode Register */
#define REG_CRCCU_SR        REG_ACCESS(RoReg, 0x4004403CU) //!< (CRCCU) CRCCU Status Register */
#define REG_CRCCU_IER       REG_ACCESS(WoReg, 0x40044040U) //!< (CRCCU) CRCCU Interrupt Enable Register */
#define REG_CRCCU_IDR       REG_ACCESS(WoReg, 0x40044044U) //!< (CRCCU) CRCCU Interrupt Disable Register */
#define REG_CRCCU_IMR       REG_ACCESS(RoReg, 0x40044048U) //!< (CRCCU) CRCCU Interrupt Mask Register */
#define REG_CRCCU_ISR       REG_ACCESS(RoReg, 0x4004404CU) //!< (CRCCU) CRCCU Interrupt Status Register */
/* ========== Register definition for SMC peripheral ========== */
#define REG_SMC_SETUP0      REG_ACCESS(RwReg, 0x400E0000U) //!< (SMC) SMC Setup Register (CS_number = 0) */
#define REG_SMC_PULSE0      REG_ACCESS(RwReg, 0x400E0004U) //!< (SMC) SMC Pulse Register (CS_number = 0) */
#define REG_SMC_CYCLE0      REG_ACCESS(RwReg, 0x400E0008U) //!< (SMC) SMC Cycle Register (CS_number = 0) */
#define REG_SMC_MODE0       REG_ACCESS(RwReg, 0x400E000CU) //!< (SMC) SMC Mode Register (CS_number = 0) */
#define REG_SMC_SETUP1      REG_ACCESS(RwReg, 0x400E0010U) //!< (SMC) SMC Setup Register (CS_number = 1) */
#define REG_SMC_PULSE1      REG_ACCESS(RwReg, 0x400E0014U) //!< (SMC) SMC Pulse Register (CS_number = 1) */
#define REG_SMC_CYCLE1      REG_ACCESS(RwReg, 0x400E0018U) //!< (SMC) SMC Cycle Register (CS_number = 1) */
#define REG_SMC_MODE1       REG_ACCESS(RwReg, 0x400E001CU) //!< (SMC) SMC Mode Register (CS_number = 1) */
#define REG_SMC_SETUP2      REG_ACCESS(RwReg, 0x400E0020U) //!< (SMC) SMC Setup Register (CS_number = 2) */
#define REG_SMC_PULSE2      REG_ACCESS(RwReg, 0x400E0024U) //!< (SMC) SMC Pulse Register (CS_number = 2) */
#define REG_SMC_CYCLE2      REG_ACCESS(RwReg, 0x400E0028U) //!< (SMC) SMC Cycle Register (CS_number = 2) */
#define REG_SMC_MODE2       REG_ACCESS(RwReg, 0x400E002CU) //!< (SMC) SMC Mode Register (CS_number = 2) */
#define REG_SMC_SETUP3      REG_ACCESS(RwReg, 0x400E0030U) //!< (SMC) SMC Setup Register (CS_number = 3) */
#define REG_SMC_PULSE3      REG_ACCESS(RwReg, 0x400E0034U) //!< (SMC) SMC Pulse Register (CS_number = 3) */
#define REG_SMC_CYCLE3      REG_ACCESS(RwReg, 0x400E0038U) //!< (SMC) SMC Cycle Register (CS_number = 3) */
#define REG_SMC_MODE3       REG_ACCESS(RwReg, 0x400E003CU) //!< (SMC) SMC Mode Register (CS_number = 3) */
#define REG_SMC_SETUP4      REG_ACCESS(RwReg, 0x400E0040U) //!< (SMC) SMC Setup Register (CS_number = 4) */
#define REG_SMC_PULSE4      REG_ACCESS(RwReg, 0x400E0044U) //!< (SMC) SMC Pulse Register (CS_number = 4) */
#define REG_SMC_CYCLE4      REG_ACCESS(RwReg, 0x400E0048U) //!< (SMC) SMC Cycle Register (CS_number = 4) */
#define REG_SMC_MODE4       REG_ACCESS(RwReg, 0x400E004CU) //!< (SMC) SMC Mode Register (CS_number = 4) */
#define REG_SMC_OCMS        REG_ACCESS(RwReg, 0x400E0080U) //!< (SMC) SMC OCMS MODE Register */
#define REG_SMC_KEY1        REG_ACCESS(WoReg, 0x400E0084U) //!< (SMC) SMC OCMS KEY1 Register */
#define REG_SMC_KEY2        REG_ACCESS(WoReg, 0x400E0088U) //!< (SMC) SMC OCMS KEY2 Register */
#define REG_SMC_WPMR        REG_ACCESS(RwReg, 0x400E00E4U) //!< (SMC) SMC Write Protect Mode Register */
#define REG_SMC_WPSR        REG_ACCESS(RoReg, 0x400E00E8U) //!< (SMC) SMC Write Protect Status Register */
/* ========== Register definition for MATRIX peripheral ========== */
#define REG_MATRIX_MCFG     REG_ACCESS(RwReg, 0x400E0200U) //!< (MATRIX) Master Configuration Register */
#define REG_MATRIX_SCFG     REG_ACCESS(RwReg, 0x400E0240U) //!< (MATRIX) Slave Configuration Register */
#define REG_MATRIX_PRAS0    REG_ACCESS(RwReg, 0x400E0280U) //!< (MATRIX) Priority Register A for Slave 0 */
#define REG_MATRIX_PRAS1    REG_ACCESS(RwReg, 0x400E0288U) //!< (MATRIX) Priority Register A for Slave 1 */
#define REG_MATRIX_PRAS2    REG_ACCESS(RwReg, 0x400E0290U) //!< (MATRIX) Priority Register A for Slave 2 */
#define REG_MATRIX_PRAS3    REG_ACCESS(RwReg, 0x400E0298U) //!< (MATRIX) Priority Register A for Slave 3 */
#define REG_MATRIX_PRAS4    REG_ACCESS(RwReg, 0x400E02A0U) //!< (MATRIX) Priority Register A for Slave 4 */
#define REG_MATRIX_SYSIO    REG_ACCESS(RwReg, 0x400E0314U) //!< (MATRIX) System I/O Configuration register */
#define REG_MATRIX_SMCNFCS  REG_ACCESS(RwReg, 0x400E031CU) //!< (MATRIX) SMC Chip Select NAND Flash Assignment Register */
#define REG_MATRIX_WPMR     REG_ACCESS(RwReg, 0x400E03E4U) //!< (MATRIX) Write Protect Mode Register */
#define REG_MATRIX_WPSR     REG_ACCESS(RoReg, 0x400E03E8U) //!< (MATRIX) Write Protect Status Register */
/* ========== Register definition for PMC peripheral ========== */
#define REG_PMC_SCER        REG_ACCESS(WoReg, 0x400E0400U) //!< @brief (PMC) System Clock Enable Register
#define REG_PMC_SCDR        REG_ACCESS(WoReg, 0x400E0404U) //!< @brief (PMC) System Clock Disable Register
#define REG_PMC_SCSR        REG_ACCESS(RoReg, 0x400E0408U) //!< @brief (PMC) System Clock Status Register
#define REG_PMC_PCER0       REG_ACCESS(WoReg, 0x400E0410U) //!< @brief (PMC) Peripheral Clock Enable Register 0
#define REG_PMC_PCDR0       REG_ACCESS(WoReg, 0x400E0414U) //!< @brief (PMC) Peripheral Clock Disable Register 0
#define REG_PMC_PCSR0       REG_ACCESS(RoReg, 0x400E0418U) //!< (PMC) Peripheral Clock Status Register 0
#define REG_PMC_MOR         REG_ACCESS(RwReg, 0x400E0420U) //!< (PMC) Main Oscillator Register
#define REG_PMC_MCFR        REG_ACCESS(RoReg, 0x400E0424U) //!< (PMC) Main Clock Frequency Register
#define REG_PMC_PLLAR       REG_ACCESS(RwReg, 0x400E0428U) //!< (PMC) PLLA Register
#define REG_PMC_PLLBR       REG_ACCESS(RwReg, 0x400E042CU) //!< (PMC) PLLB Register
#define REG_PMC_MCKR        REG_ACCESS(RwReg, 0x400E0430U) //!< (PMC) Master Clock Register
#define REG_PMC_USB         REG_ACCESS(RwReg, 0x400E0438U) //!< (PMC) USB Clock Register
#define REG_PMC_PCK         REG_ACCESS(RwReg, 0x400E0440U) //!< (PMC) Programmable Clock 0 Register
#define REG_PMC_IER         REG_ACCESS(WoReg, 0x400E0460U) //!< (PMC) Interrupt Enable Register
#define REG_PMC_IDR         REG_ACCESS(WoReg, 0x400E0464U) //!< (PMC) Interrupt Disable Register
#define REG_PMC_SR          REG_ACCESS(RoReg, 0x400E0468U) //!< (PMC) Status Register
#define REG_PMC_IMR         REG_ACCESS(RoReg, 0x400E046CU) //!< (PMC) Interrupt Mask Register
#define REG_PMC_FSMR        REG_ACCESS(RwReg, 0x400E0470U) //!< (PMC) Fast Startup Mode Register
#define REG_PMC_FSPR        REG_ACCESS(RwReg, 0x400E0474U) //!< (PMC) Fast Startup Polarity Register
#define REG_PMC_FOCR        REG_ACCESS(WoReg, 0x400E0478U) //!< (PMC) Fault Output Clear Register
#define REG_PMC_WPMR        REG_ACCESS(RwReg, 0x400E04E4U) //!< (PMC) Write Protect Mode Register
#define REG_PMC_WPSR        REG_ACCESS(RoReg, 0x400E04E8U) //!< (PMC) Write Protect Status Register
#define REG_PMC_PCER1       REG_ACCESS(WoReg, 0x400E0500U) //!< (PMC) Peripheral Clock Enable Register 1
#define REG_PMC_PCDR1       REG_ACCESS(WoReg, 0x400E0504U) //!< (PMC) Peripheral Clock Disable Register 1
#define REG_PMC_PCSR1       REG_ACCESS(RoReg, 0x400E0508U) //!< (PMC) Peripheral Clock Status Register 1
#define REG_PMC_OCR         REG_ACCESS(RwReg, 0x400E0510U) //!< (PMC) Oscillator Calibration Register
/* ========== Register definition for UART0 peripheral ========== */
#define REG_UART0_CR        REG_ACCESS(WoReg, 0x400E0600U) //!< (UART0) Control Register */
#define REG_UART0_MR        REG_ACCESS(RwReg, 0x400E0604U) //!< (UART0) Mode Register */
#define REG_UART0_IER       REG_ACCESS(WoReg, 0x400E0608U) //!< (UART0) Interrupt Enable Register */
#define REG_UART0_IDR       REG_ACCESS(WoReg, 0x400E060CU) //!< (UART0) Interrupt Disable Register */
#define REG_UART0_IMR       REG_ACCESS(RoReg, 0x400E0610U) //!< (UART0) Interrupt Mask Register */
#define REG_UART0_SR        REG_ACCESS(RoReg, 0x400E0614U) //!< (UART0) Status Register */
#define REG_UART0_RHR       REG_ACCESS(RoReg, 0x400E0618U) //!< (UART0) Receive Holding Register */
#define REG_UART0_THR       REG_ACCESS(WoReg, 0x400E061CU) //!< (UART0) Transmit Holding Register */
#define REG_UART0_BRGR      REG_ACCESS(RwReg, 0x400E0620U) //!< (UART0) Baud Rate Generator Register */
#define REG_UART0_RPR       REG_ACCESS(RwReg, 0x400E0700U) //!< (UART0) Receive Pointer Register */
#define REG_UART0_RCR       REG_ACCESS(RwReg, 0x400E0704U) //!< (UART0) Receive Counter Register */
#define REG_UART0_TPR       REG_ACCESS(RwReg, 0x400E0708U) //!< (UART0) Transmit Pointer Register */
#define REG_UART0_TCR       REG_ACCESS(RwReg, 0x400E070CU) //!< (UART0) Transmit Counter Register */
#define REG_UART0_RNPR      REG_ACCESS(RwReg, 0x400E0710U) //!< (UART0) Receive Next Pointer Register */
#define REG_UART0_RNCR      REG_ACCESS(RwReg, 0x400E0714U) //!< (UART0) Receive Next Counter Register */
#define REG_UART0_TNPR      REG_ACCESS(RwReg, 0x400E0718U) //!< (UART0) Transmit Next Pointer Register */
#define REG_UART0_TNCR      REG_ACCESS(RwReg, 0x400E071CU) //!< (UART0) Transmit Next Counter Register */
#define REG_UART0_PTCR      REG_ACCESS(WoReg, 0x400E0720U) //!< (UART0) Transfer Control Register */
#define REG_UART0_PTSR      REG_ACCESS(RoReg, 0x400E0724U) //!< (UART0) Transfer Status Register */
/* ========== Register definition for CHIPID peripheral ========== */
#define REG_CHIPID_CIDR     REG_ACCESS(RoReg, 0x400E0740U) //!< (CHIPID) Chip ID Register */
#define REG_CHIPID_EXID     REG_ACCESS(RoReg, 0x400E0744U) //!< (CHIPID) Chip ID Extension Register */
/* ========== Register definition for UART1 peripheral ========== */
#define REG_UART1_CR        REG_ACCESS(WoReg, 0x400E0800U) //!< (UART1) Control Register */
#define REG_UART1_MR        REG_ACCESS(RwReg, 0x400E0804U) //!< (UART1) Mode Register */
#define REG_UART1_IER       REG_ACCESS(WoReg, 0x400E0808U) //!< (UART1) Interrupt Enable Register */
#define REG_UART1_IDR       REG_ACCESS(WoReg, 0x400E080CU) //!< (UART1) Interrupt Disable Register */
#define REG_UART1_IMR       REG_ACCESS(RoReg, 0x400E0810U) //!< (UART1) Interrupt Mask Register */
#define REG_UART1_SR        REG_ACCESS(RoReg, 0x400E0814U) //!< (UART1) Status Register */
#define REG_UART1_RHR       REG_ACCESS(RoReg, 0x400E0818U) //!< (UART1) Receive Holding Register */
#define REG_UART1_THR       REG_ACCESS(WoReg, 0x400E081CU) //!< (UART1) Transmit Holding Register */
#define REG_UART1_BRGR      REG_ACCESS(RwReg, 0x400E0820U) //!< (UART1) Baud Rate Generator Register */
#define REG_UART1_RPR       REG_ACCESS(RwReg, 0x400E0900U) //!< (UART1) Receive Pointer Register */
#define REG_UART1_RCR       REG_ACCESS(RwReg, 0x400E0904U) //!< (UART1) Receive Counter Register */
#define REG_UART1_TPR       REG_ACCESS(RwReg, 0x400E0908U) //!< (UART1) Transmit Pointer Register */
#define REG_UART1_TCR       REG_ACCESS(RwReg, 0x400E090CU) //!< (UART1) Transmit Counter Register */
#define REG_UART1_RNPR      REG_ACCESS(RwReg, 0x400E0910U) //!< (UART1) Receive Next Pointer Register */
#define REG_UART1_RNCR      REG_ACCESS(RwReg, 0x400E0914U) //!< (UART1) Receive Next Counter Register */
#define REG_UART1_TNPR      REG_ACCESS(RwReg, 0x400E0918U) //!< (UART1) Transmit Next Pointer Register */
#define REG_UART1_TNCR      REG_ACCESS(RwReg, 0x400E091CU) //!< (UART1) Transmit Next Counter Register */
#define REG_UART1_PTCR      REG_ACCESS(WoReg, 0x400E0920U) //!< (UART1) Transfer Control Register */
#define REG_UART1_PTSR      REG_ACCESS(RoReg, 0x400E0924U) //!< (UART1) Transfer Status Register */
/* ========== Register definition for EFC peripheral ========== */
#define REG_EFC_FMR         REG_ACCESS(RwReg, 0x400E0A00U) //!< (EFC) EEFC Flash Mode Register */
#define REG_EFC_FCR         REG_ACCESS(WoReg, 0x400E0A04U) //!< (EFC) EEFC Flash Command Register */
#define REG_EFC_FSR         REG_ACCESS(RoReg, 0x400E0A08U) //!< (EFC) EEFC Flash Status Register */
#define REG_EFC_FRR         REG_ACCESS(RoReg, 0x400E0A0CU) //!< (EFC) EEFC Flash Result Register */
/* ========== Register definition for PIOA peripheral ========== */
#define REG_PIOA_PER        REG_ACCESS(WoReg, 0x400E0E00U) //!< (PIOA) PIO Enable Register */
#define REG_PIOA_PDR        REG_ACCESS(WoReg, 0x400E0E04U) //!< (PIOA) PIO Disable Register */
#define REG_PIOA_PSR        REG_ACCESS(RoReg, 0x400E0E08U) //!< (PIOA) PIO Status Register */
#define REG_PIOA_OER        REG_ACCESS(WoReg, 0x400E0E10U) //!< (PIOA) Output Enable Register */
#define REG_PIOA_ODR        REG_ACCESS(WoReg, 0x400E0E14U) //!< (PIOA) Output Disable Register */
#define REG_PIOA_OSR        REG_ACCESS(RoReg, 0x400E0E18U) //!< (PIOA) Output Status Register */
#define REG_PIOA_IFER       REG_ACCESS(WoReg, 0x400E0E20U) //!< (PIOA) Glitch Input Filter Enable Register */
#define REG_PIOA_IFDR       REG_ACCESS(WoReg, 0x400E0E24U) //!< (PIOA) Glitch Input Filter Disable Register */
#define REG_PIOA_IFSR       REG_ACCESS(RoReg, 0x400E0E28U) //!< (PIOA) Glitch Input Filter Status Register */
#define REG_PIOA_SODR       REG_ACCESS(WoReg, 0x400E0E30U) //!< (PIOA) Set Output Data Register */
#define REG_PIOA_CODR       REG_ACCESS(WoReg, 0x400E0E34U) //!< (PIOA) Clear Output Data Register */
#define REG_PIOA_ODSR       REG_ACCESS(RwReg, 0x400E0E38U) //!< (PIOA) Output Data Status Register */
#define REG_PIOA_PDSR       REG_ACCESS(RoReg, 0x400E0E3CU) //!< (PIOA) Pin Data Status Register */
#define REG_PIOA_IER        REG_ACCESS(WoReg, 0x400E0E40U) //!< (PIOA) Interrupt Enable Register */
#define REG_PIOA_IDR        REG_ACCESS(WoReg, 0x400E0E44U) //!< (PIOA) Interrupt Disable Register */
#define REG_PIOA_IMR        REG_ACCESS(RoReg, 0x400E0E48U) //!< (PIOA) Interrupt Mask Register */
#define REG_PIOA_ISR        REG_ACCESS(RoReg, 0x400E0E4CU) //!< (PIOA) Interrupt Status Register */
#define REG_PIOA_MDER       REG_ACCESS(WoReg, 0x400E0E50U) //!< (PIOA) Multi-driver Enable Register */
#define REG_PIOA_MDDR       REG_ACCESS(WoReg, 0x400E0E54U) //!< (PIOA) Multi-driver Disable Register */
#define REG_PIOA_MDSR       REG_ACCESS(RoReg, 0x400E0E58U) //!< (PIOA) Multi-driver Status Register */
#define REG_PIOA_PUDR       REG_ACCESS(WoReg, 0x400E0E60U) //!< (PIOA) Pull-up Disable Register */
#define REG_PIOA_PUER       REG_ACCESS(WoReg, 0x400E0E64U) //!< (PIOA) Pull-up Enable Register */
#define REG_PIOA_PUSR       REG_ACCESS(RoReg, 0x400E0E68U) //!< (PIOA) Pad Pull-up Status Register */
#define REG_PIOA_ABCDSR     REG_ACCESS(RwReg, 0x400E0E70U) //!< (PIOA) Peripheral Select Register */
#define REG_PIOA_IFSCDR     REG_ACCESS(WoReg, 0x400E0E80U) //!< (PIOA) Input Filter Slow Clock Disable Register */
#define REG_PIOA_IFSCER     REG_ACCESS(WoReg, 0x400E0E84U) //!< (PIOA) Input Filter Slow Clock Enable Register */
#define REG_PIOA_IFSCSR     REG_ACCESS(RoReg, 0x400E0E88U) //!< (PIOA) Input Filter Slow Clock Status Register */
#define REG_PIOA_SCDR       REG_ACCESS(RwReg, 0x400E0E8CU) //!< (PIOA) Slow Clock Divider Debouncing Register */
#define REG_PIOA_PPDDR      REG_ACCESS(WoReg, 0x400E0E90U) //!< (PIOA) Pad Pull-down Disable Register */
#define REG_PIOA_PPDER      REG_ACCESS(WoReg, 0x400E0E94U) //!< (PIOA) Pad Pull-down Enable Register */
#define REG_PIOA_PPDSR      REG_ACCESS(RoReg, 0x400E0E98U) //!< (PIOA) Pad Pull-down Status Register */
#define REG_PIOA_OWER       REG_ACCESS(WoReg, 0x400E0EA0U) //!< (PIOA) Output Write Enable */
#define REG_PIOA_OWDR       REG_ACCESS(WoReg, 0x400E0EA4U) //!< (PIOA) Output Write Disable */
#define REG_PIOA_OWSR       REG_ACCESS(RoReg, 0x400E0EA8U) //!< (PIOA) Output Write Status Register */
#define REG_PIOA_AIMER      REG_ACCESS(WoReg, 0x400E0EB0U) //!< (PIOA) Additional Interrupt Modes Enable Register */
#define REG_PIOA_AIMDR      REG_ACCESS(WoReg, 0x400E0EB4U) //!< (PIOA) Additional Interrupt Modes Disables Register */
#define REG_PIOA_AIMMR      REG_ACCESS(RoReg, 0x400E0EB8U) //!< (PIOA) Additional Interrupt Modes Mask Register */
#define REG_PIOA_ESR        REG_ACCESS(WoReg, 0x400E0EC0U) //!< (PIOA) Edge Select Register */
#define REG_PIOA_LSR        REG_ACCESS(WoReg, 0x400E0EC4U) //!< (PIOA) Level Select Register */
#define REG_PIOA_ELSR       REG_ACCESS(RoReg, 0x400E0EC8U) //!< (PIOA) Edge/Level Status Register */
#define REG_PIOA_FELLSR     REG_ACCESS(WoReg, 0x400E0ED0U) //!< (PIOA) Falling Edge/Low Level Select Register */
#define REG_PIOA_REHLSR     REG_ACCESS(WoReg, 0x400E0ED4U) //!< (PIOA) Rising Edge/ High Level Select Register */
#define REG_PIOA_FRLHSR     REG_ACCESS(RoReg, 0x400E0ED8U) //!< (PIOA) Fall/Rise - Low/High Status Register */
#define REG_PIOA_LOCKSR     REG_ACCESS(RoReg, 0x400E0EE0U) //!< (PIOA) Lock Status */
#define REG_PIOA_WPMR       REG_ACCESS(RwReg, 0x400E0EE4U) //!< (PIOA) Write Protect Mode Register */
#define REG_PIOA_WPSR       REG_ACCESS(RoReg, 0x400E0EE8U) //!< (PIOA) Write Protect Status Register */
#define REG_PIOA_SCHMITT    REG_ACCESS(RwReg, 0x400E0F00U) //!< (PIOA) Schmitt Trigger Register */
#define REG_PIOA_PCMR       REG_ACCESS(RwReg, 0x400E0F50U) //!< (PIOA) Parallel Capture Mode Register */
#define REG_PIOA_PCIER      REG_ACCESS(WoReg, 0x400E0F54U) //!< (PIOA) Parallel Capture Interrupt Enable Register */
#define REG_PIOA_PCIDR      REG_ACCESS(WoReg, 0x400E0F58U) //!< (PIOA) Parallel Capture Interrupt Disable Register */
#define REG_PIOA_PCIMR      REG_ACCESS(RoReg, 0x400E0F5CU) //!< (PIOA) Parallel Capture Interrupt Mask Register */
#define REG_PIOA_PCISR      REG_ACCESS(RoReg, 0x400E0F60U) //!< (PIOA) Parallel Capture Interrupt Status Register */
#define REG_PIOA_PCRHR      REG_ACCESS(RoReg, 0x400E0F64U) //!< (PIOA) Parallel Capture Reception Holding Register */
#define REG_PIOA_RPR        REG_ACCESS(RwReg, 0x400E0F68U) //!< (PIOA) Receive Pointer Register */
#define REG_PIOA_RCR        REG_ACCESS(RwReg, 0x400E0F6CU) //!< (PIOA) Receive Counter Register */
#define REG_PIOA_TPR        REG_ACCESS(RwReg, 0x400E0F70U) //!< (PIOA) Transmit Pointer Register */
#define REG_PIOA_TCR        REG_ACCESS(RwReg, 0x400E0F74U) //!< (PIOA) Transmit Counter Register */
#define REG_PIOA_RNPR       REG_ACCESS(RwReg, 0x400E0F78U) //!< (PIOA) Receive Next Pointer Register */
#define REG_PIOA_RNCR       REG_ACCESS(RwReg, 0x400E0F7CU) //!< (PIOA) Receive Next Counter Register */
#define REG_PIOA_TNPR       REG_ACCESS(RwReg, 0x400E0F80U) //!< (PIOA) Transmit Next Pointer Register */
#define REG_PIOA_TNCR       REG_ACCESS(RwReg, 0x400E0F84U) //!< (PIOA) Transmit Next Counter Register */
#define REG_PIOA_PTCR       REG_ACCESS(WoReg, 0x400E0F88U) //!< (PIOA) Transfer Control Register */
#define REG_PIOA_PTSR       REG_ACCESS(RoReg, 0x400E0F8CU) //!< (PIOA) Transfer Status Register */
/* ========== Register definition for PIOB peripheral ========== */
#define REG_PIOB_PER        REG_ACCESS(WoReg, 0x400E1000U) //!< (PIOB) PIO Enable Register */
#define REG_PIOB_PDR        REG_ACCESS(WoReg, 0x400E1004U) //!< (PIOB) PIO Disable Register */
#define REG_PIOB_PSR        REG_ACCESS(RoReg, 0x400E1008U) //!< (PIOB) PIO Status Register */
#define REG_PIOB_OER        REG_ACCESS(WoReg, 0x400E1010U) //!< (PIOB) Output Enable Register */
#define REG_PIOB_ODR        REG_ACCESS(WoReg, 0x400E1014U) //!< (PIOB) Output Disable Register */
#define REG_PIOB_OSR        REG_ACCESS(RoReg, 0x400E1018U) //!< (PIOB) Output Status Register */
#define REG_PIOB_IFER       REG_ACCESS(WoReg, 0x400E1020U) //!< (PIOB) Glitch Input Filter Enable Register */
#define REG_PIOB_IFDR       REG_ACCESS(WoReg, 0x400E1024U) //!< (PIOB) Glitch Input Filter Disable Register */
#define REG_PIOB_IFSR       REG_ACCESS(RoReg, 0x400E1028U) //!< (PIOB) Glitch Input Filter Status Register */
#define REG_PIOB_SODR       REG_ACCESS(WoReg, 0x400E1030U) //!< (PIOB) Set Output Data Register */
#define REG_PIOB_CODR       REG_ACCESS(WoReg, 0x400E1034U) //!< (PIOB) Clear Output Data Register */
#define REG_PIOB_ODSR       REG_ACCESS(RwReg, 0x400E1038U) //!< (PIOB) Output Data Status Register */
#define REG_PIOB_PDSR       REG_ACCESS(RoReg, 0x400E103CU) //!< (PIOB) Pin Data Status Register */
#define REG_PIOB_IER        REG_ACCESS(WoReg, 0x400E1040U) //!< (PIOB) Interrupt Enable Register */
#define REG_PIOB_IDR        REG_ACCESS(WoReg, 0x400E1044U) //!< (PIOB) Interrupt Disable Register */
#define REG_PIOB_IMR        REG_ACCESS(RoReg, 0x400E1048U) //!< (PIOB) Interrupt Mask Register */
#define REG_PIOB_ISR        REG_ACCESS(RoReg, 0x400E104CU) //!< (PIOB) Interrupt Status Register */
#define REG_PIOB_MDER       REG_ACCESS(WoReg, 0x400E1050U) //!< (PIOB) Multi-driver Enable Register */
#define REG_PIOB_MDDR       REG_ACCESS(WoReg, 0x400E1054U) //!< (PIOB) Multi-driver Disable Register */
#define REG_PIOB_MDSR       REG_ACCESS(RoReg, 0x400E1058U) //!< (PIOB) Multi-driver Status Register */
#define REG_PIOB_PUDR       REG_ACCESS(WoReg, 0x400E1060U) //!< (PIOB) Pull-up Disable Register */
#define REG_PIOB_PUER       REG_ACCESS(WoReg, 0x400E1064U) //!< (PIOB) Pull-up Enable Register */
#define REG_PIOB_PUSR       REG_ACCESS(RoReg, 0x400E1068U) //!< (PIOB) Pad Pull-up Status Register */
#define REG_PIOB_ABCDSR     REG_ACCESS(RwReg, 0x400E1070U) //!< (PIOB) Peripheral Select Register */
#define REG_PIOB_IFSCDR     REG_ACCESS(WoReg, 0x400E1080U) //!< (PIOB) Input Filter Slow Clock Disable Register */
#define REG_PIOB_IFSCER     REG_ACCESS(WoReg, 0x400E1084U) //!< (PIOB) Input Filter Slow Clock Enable Register */
#define REG_PIOB_IFSCSR     REG_ACCESS(RoReg, 0x400E1088U) //!< (PIOB) Input Filter Slow Clock Status Register */
#define REG_PIOB_SCDR       REG_ACCESS(RwReg, 0x400E108CU) //!< (PIOB) Slow Clock Divider Debouncing Register */
#define REG_PIOB_PPDDR      REG_ACCESS(WoReg, 0x400E1090U) //!< (PIOB) Pad Pull-down Disable Register */
#define REG_PIOB_PPDER      REG_ACCESS(WoReg, 0x400E1094U) //!< (PIOB) Pad Pull-down Enable Register */
#define REG_PIOB_PPDSR      REG_ACCESS(RoReg, 0x400E1098U) //!< (PIOB) Pad Pull-down Status Register */
