miro-kostadinov/tmos/tags/tmos/5.02.1.0/hardware/at91/cortex-m3/sam3s/series_map.h
#define REG_PIOB_OWER       REG_ACCESS(WoReg, 0x400E10A0U) //!< (PIOB) Output Write Enable */
#define REG_PIOB_OWDR       REG_ACCESS(WoReg, 0x400E10A4U) //!< (PIOB) Output Write Disable */
#define REG_PIOB_OWSR       REG_ACCESS(RoReg, 0x400E10A8U) //!< (PIOB) Output Write Status Register */
#define REG_PIOB_AIMER      REG_ACCESS(WoReg, 0x400E10B0U) //!< (PIOB) Additional Interrupt Modes Enable Register */
#define REG_PIOB_AIMDR      REG_ACCESS(WoReg, 0x400E10B4U) //!< (PIOB) Additional Interrupt Modes Disables Register */
#define REG_PIOB_AIMMR      REG_ACCESS(RoReg, 0x400E10B8U) //!< (PIOB) Additional Interrupt Modes Mask Register */
#define REG_PIOB_ESR        REG_ACCESS(WoReg, 0x400E10C0U) //!< (PIOB) Edge Select Register */
#define REG_PIOB_LSR        REG_ACCESS(WoReg, 0x400E10C4U) //!< (PIOB) Level Select Register */
#define REG_PIOB_ELSR       REG_ACCESS(RoReg, 0x400E10C8U) //!< (PIOB) Edge/Level Status Register */
#define REG_PIOB_FELLSR     REG_ACCESS(WoReg, 0x400E10D0U) //!< (PIOB) Falling Edge/Low Level Select Register */
#define REG_PIOB_REHLSR     REG_ACCESS(WoReg, 0x400E10D4U) //!< (PIOB) Rising Edge/ High Level Select Register */
#define REG_PIOB_FRLHSR     REG_ACCESS(RoReg, 0x400E10D8U) //!< (PIOB) Fall/Rise - Low/High Status Register */
#define REG_PIOB_LOCKSR     REG_ACCESS(RoReg, 0x400E10E0U) //!< (PIOB) Lock Status */
#define REG_PIOB_WPMR       REG_ACCESS(RwReg, 0x400E10E4U) //!< (PIOB) Write Protect Mode Register */
#define REG_PIOB_WPSR       REG_ACCESS(RoReg, 0x400E10E8U) //!< (PIOB) Write Protect Status Register */
#define REG_PIOB_SCHMITT    REG_ACCESS(RwReg, 0x400E1100U) //!< (PIOB) Schmitt Trigger Register */
#define REG_PIOB_PCMR       REG_ACCESS(RwReg, 0x400E1150U) //!< (PIOB) Parallel Capture Mode Register */
#define REG_PIOB_PCIER      REG_ACCESS(WoReg, 0x400E1154U) //!< (PIOB) Parallel Capture Interrupt Enable Register */
#define REG_PIOB_PCIDR      REG_ACCESS(WoReg, 0x400E1158U) //!< (PIOB) Parallel Capture Interrupt Disable Register */
#define REG_PIOB_PCIMR      REG_ACCESS(RoReg, 0x400E115CU) //!< (PIOB) Parallel Capture Interrupt Mask Register */
#define REG_PIOB_PCISR      REG_ACCESS(RoReg, 0x400E1160U) //!< (PIOB) Parallel Capture Interrupt Status Register */
#define REG_PIOB_PCRHR      REG_ACCESS(RoReg, 0x400E1164U) //!< (PIOB) Parallel Capture Reception Holding Register */
/* ========== Register definition for PIOC peripheral ========== */
#define REG_PIOC_PER        REG_ACCESS(WoReg, 0x400E1200U) //!< (PIOC) PIO Enable Register */
#define REG_PIOC_PDR        REG_ACCESS(WoReg, 0x400E1204U) //!< (PIOC) PIO Disable Register */
#define REG_PIOC_PSR        REG_ACCESS(RoReg, 0x400E1208U) //!< (PIOC) PIO Status Register */
#define REG_PIOC_OER        REG_ACCESS(WoReg, 0x400E1210U) //!< (PIOC) Output Enable Register */
#define REG_PIOC_ODR        REG_ACCESS(WoReg, 0x400E1214U) //!< (PIOC) Output Disable Register */
#define REG_PIOC_OSR        REG_ACCESS(RoReg, 0x400E1218U) //!< (PIOC) Output Status Register */
#define REG_PIOC_IFER       REG_ACCESS(WoReg, 0x400E1220U) //!< (PIOC) Glitch Input Filter Enable Register */
#define REG_PIOC_IFDR       REG_ACCESS(WoReg, 0x400E1224U) //!< (PIOC) Glitch Input Filter Disable Register */
#define REG_PIOC_IFSR       REG_ACCESS(RoReg, 0x400E1228U) //!< (PIOC) Glitch Input Filter Status Register */
#define REG_PIOC_SODR       REG_ACCESS(WoReg, 0x400E1230U) //!< (PIOC) Set Output Data Register */
#define REG_PIOC_CODR       REG_ACCESS(WoReg, 0x400E1234U) //!< (PIOC) Clear Output Data Register */
#define REG_PIOC_ODSR       REG_ACCESS(RwReg, 0x400E1238U) //!< (PIOC) Output Data Status Register */
#define REG_PIOC_PDSR       REG_ACCESS(RoReg, 0x400E123CU) //!< (PIOC) Pin Data Status Register */
#define REG_PIOC_IER        REG_ACCESS(WoReg, 0x400E1240U) //!< (PIOC) Interrupt Enable Register */
#define REG_PIOC_IDR        REG_ACCESS(WoReg, 0x400E1244U) //!< (PIOC) Interrupt Disable Register */
#define REG_PIOC_IMR        REG_ACCESS(RoReg, 0x400E1248U) //!< (PIOC) Interrupt Mask Register */
#define REG_PIOC_ISR        REG_ACCESS(RoReg, 0x400E124CU) //!< (PIOC) Interrupt Status Register */
#define REG_PIOC_MDER       REG_ACCESS(WoReg, 0x400E1250U) //!< (PIOC) Multi-driver Enable Register */
#define REG_PIOC_MDDR       REG_ACCESS(WoReg, 0x400E1254U) //!< (PIOC) Multi-driver Disable Register */
#define REG_PIOC_MDSR       REG_ACCESS(RoReg, 0x400E1258U) //!< (PIOC) Multi-driver Status Register */
#define REG_PIOC_PUDR       REG_ACCESS(WoReg, 0x400E1260U) //!< (PIOC) Pull-up Disable Register */
#define REG_PIOC_PUER       REG_ACCESS(WoReg, 0x400E1264U) //!< (PIOC) Pull-up Enable Register */
#define REG_PIOC_PUSR       REG_ACCESS(RoReg, 0x400E1268U) //!< (PIOC) Pad Pull-up Status Register */
#define REG_PIOC_ABCDSR     REG_ACCESS(RwReg, 0x400E1270U) //!< (PIOC) Peripheral Select Register */
#define REG_PIOC_IFSCDR     REG_ACCESS(WoReg, 0x400E1280U) //!< (PIOC) Input Filter Slow Clock Disable Register */
#define REG_PIOC_IFSCER     REG_ACCESS(WoReg, 0x400E1284U) //!< (PIOC) Input Filter Slow Clock Enable Register */
#define REG_PIOC_IFSCSR     REG_ACCESS(RoReg, 0x400E1288U) //!< (PIOC) Input Filter Slow Clock Status Register */
#define REG_PIOC_SCDR       REG_ACCESS(RwReg, 0x400E128CU) //!< (PIOC) Slow Clock Divider Debouncing Register */
#define REG_PIOC_PPDDR      REG_ACCESS(WoReg, 0x400E1290U) //!< (PIOC) Pad Pull-down Disable Register */
#define REG_PIOC_PPDER      REG_ACCESS(WoReg, 0x400E1294U) //!< (PIOC) Pad Pull-down Enable Register */
#define REG_PIOC_PPDSR      REG_ACCESS(RoReg, 0x400E1298U) //!< (PIOC) Pad Pull-down Status Register */
#define REG_PIOC_OWER       REG_ACCESS(WoReg, 0x400E12A0U) //!< (PIOC) Output Write Enable */
#define REG_PIOC_OWDR       REG_ACCESS(WoReg, 0x400E12A4U) //!< (PIOC) Output Write Disable */
#define REG_PIOC_OWSR       REG_ACCESS(RoReg, 0x400E12A8U) //!< (PIOC) Output Write Status Register */
#define REG_PIOC_AIMER      REG_ACCESS(WoReg, 0x400E12B0U) //!< (PIOC) Additional Interrupt Modes Enable Register */
#define REG_PIOC_AIMDR      REG_ACCESS(WoReg, 0x400E12B4U) //!< (PIOC) Additional Interrupt Modes Disables Register */
#define REG_PIOC_AIMMR      REG_ACCESS(RoReg, 0x400E12B8U) //!< (PIOC) Additional Interrupt Modes Mask Register */
#define REG_PIOC_ESR        REG_ACCESS(WoReg, 0x400E12C0U) //!< (PIOC) Edge Select Register */
#define REG_PIOC_LSR        REG_ACCESS(WoReg, 0x400E12C4U) //!< (PIOC) Level Select Register */
#define REG_PIOC_ELSR       REG_ACCESS(RoReg, 0x400E12C8U) //!< (PIOC) Edge/Level Status Register */
#define REG_PIOC_FELLSR     REG_ACCESS(WoReg, 0x400E12D0U) //!< (PIOC) Falling Edge/Low Level Select Register */
#define REG_PIOC_REHLSR     REG_ACCESS(WoReg, 0x400E12D4U) //!< (PIOC) Rising Edge/ High Level Select Register */
#define REG_PIOC_FRLHSR     REG_ACCESS(RoReg, 0x400E12D8U) //!< (PIOC) Fall/Rise - Low/High Status Register */
#define REG_PIOC_LOCKSR     REG_ACCESS(RoReg, 0x400E12E0U) //!< (PIOC) Lock Status */
#define REG_PIOC_WPMR       REG_ACCESS(RwReg, 0x400E12E4U) //!< (PIOC) Write Protect Mode Register */
#define REG_PIOC_WPSR       REG_ACCESS(RoReg, 0x400E12E8U) //!< (PIOC) Write Protect Status Register */
#define REG_PIOC_SCHMITT    REG_ACCESS(RwReg, 0x400E1300U) //!< (PIOC) Schmitt Trigger Register */
#define REG_PIOC_PCMR       REG_ACCESS(RwReg, 0x400E1350U) //!< (PIOC) Parallel Capture Mode Register */
#define REG_PIOC_PCIER      REG_ACCESS(WoReg, 0x400E1354U) //!< (PIOC) Parallel Capture Interrupt Enable Register */
#define REG_PIOC_PCIDR      REG_ACCESS(WoReg, 0x400E1358U) //!< (PIOC) Parallel Capture Interrupt Disable Register */
#define REG_PIOC_PCIMR      REG_ACCESS(RoReg, 0x400E135CU) //!< (PIOC) Parallel Capture Interrupt Mask Register */
#define REG_PIOC_PCISR      REG_ACCESS(RoReg, 0x400E1360U) //!< (PIOC) Parallel Capture Interrupt Status Register */
#define REG_PIOC_PCRHR      REG_ACCESS(RoReg, 0x400E1364U) //!< (PIOC) Parallel Capture Reception Holding Register */
/* ========== Register definition for RSTC peripheral ========== */
#define REG_RSTC_CR         REG_ACCESS(WoReg, 0x400E1400U) //!< (RSTC) Control Register */
#define REG_RSTC_SR         REG_ACCESS(RoReg, 0x400E1404U) //!< (RSTC) Status Register */
#define REG_RSTC_MR         REG_ACCESS(RwReg, 0x400E1408U) //!< (RSTC) Mode Register */
/* ========== Register definition for SUPC peripheral ========== */
#define REG_SUPC_CR         REG_ACCESS(WoReg, 0x400E1410U) //!< (SUPC) Supply Controller Control Register */
#define REG_SUPC_SMMR       REG_ACCESS(RwReg, 0x400E1414U) //!< (SUPC) Supply Controller Supply Monitor Mode Register */
#define REG_SUPC_MR         REG_ACCESS(RwReg, 0x400E1418U) //!< (SUPC) Supply Controller Mode Register */
#define REG_SUPC_WUMR       REG_ACCESS(RwReg, 0x400E141CU) //!< (SUPC) Supply Controller Wake Up Mode Register */
#define REG_SUPC_WUIR       REG_ACCESS(RwReg, 0x400E1420U) //!< (SUPC) Supply Controller Wake Up Inputs Register */
#define REG_SUPC_SR         REG_ACCESS(RoReg, 0x400E1424U) //!< (SUPC) Supply Controller Status Register */
/* ========== Register definition for RTT peripheral ========== */
#define REG_RTT_MR          REG_ACCESS(RwReg, 0x400E1430U) //!< (RTT) Mode Register */
#define REG_RTT_AR          REG_ACCESS(RwReg, 0x400E1434U) //!< (RTT) Alarm Register */
#define REG_RTT_VR          REG_ACCESS(RoReg, 0x400E1438U) //!< (RTT) Value Register */
#define REG_RTT_SR          REG_ACCESS(RoReg, 0x400E143CU) //!< (RTT) Status Register */
/* ========== Register definition for WDT peripheral ========== */
#define REG_WDT_CR          REG_ACCESS(WoReg, 0x400E1450U) //!< (WDT) Control Register */
#define REG_WDT_MR          REG_ACCESS(RwReg, 0x400E1454U) //!< (WDT) Mode Register */
#define REG_WDT_SR          REG_ACCESS(RoReg, 0x400E1458U) //!< (WDT) Status Register */
/* ========== Register definition for RTC peripheral ========== */
#define REG_RTC_CR          REG_ACCESS(RwReg, 0x400E1460U) //!< (RTC) Control Register */
#define REG_RTC_MR          REG_ACCESS(RwReg, 0x400E1464U) //!< (RTC) Mode Register */
#define REG_RTC_TIMR        REG_ACCESS(RwReg, 0x400E1468U) //!< (RTC) Time Register */
#define REG_RTC_CALR        REG_ACCESS(RwReg, 0x400E146CU) //!< (RTC) Calendar Register */
#define REG_RTC_TIMALR      REG_ACCESS(RwReg, 0x400E1470U) //!< (RTC) Time Alarm Register */
#define REG_RTC_CALALR      REG_ACCESS(RwReg, 0x400E1474U) //!< (RTC) Calendar Alarm Register */
#define REG_RTC_SR          REG_ACCESS(RoReg, 0x400E1478U) //!< (RTC) Status Register */
#define REG_RTC_SCCR        REG_ACCESS(WoReg, 0x400E147CU) //!< (RTC) Status Clear Command Register */
#define REG_RTC_IER         REG_ACCESS(WoReg, 0x400E1480U) //!< (RTC) Interrupt Enable Register */
#define REG_RTC_IDR         REG_ACCESS(WoReg, 0x400E1484U) //!< (RTC) Interrupt Disable Register */
#define REG_RTC_IMR         REG_ACCESS(RoReg, 0x400E1488U) //!< (RTC) Interrupt Mask Register */
#define REG_RTC_VER         REG_ACCESS(RoReg, 0x400E148CU) //!< (RTC) Valid Entry Register */
/* ========== Register definition for GPBR peripheral ========== */
#define REG_GPBR_GPBR0      REG_ACCESS(RwReg, 0x400E1490U) //!< (GPBR) General Purpose Backup Register 0 */
#define REG_GPBR_GPBR1      REG_ACCESS(RwReg, 0x400E1494U) //!< (GPBR) General Purpose Backup Register 1 */
#define REG_GPBR_GPBR2      REG_ACCESS(RwReg, 0x400E1498U) //!< (GPBR) General Purpose Backup Register 2 */
#define REG_GPBR_GPBR3      REG_ACCESS(RwReg, 0x400E149CU) //!< (GPBR) General Purpose Backup Register 3 */
#define REG_GPBR_GPBR4      REG_ACCESS(RwReg, 0x400E14A0U) //!< (GPBR) General Purpose Backup Register 4 */
#define REG_GPBR_GPBR5      REG_ACCESS(RwReg, 0x400E14A4U) //!< (GPBR) General Purpose Backup Register 5 */
#define REG_GPBR_GPBR6      REG_ACCESS(RwReg, 0x400E14A8U) //!< (GPBR) General Purpose Backup Register 6 */
#define REG_GPBR_GPBR7      REG_ACCESS(RwReg, 0x400E14ACU) //!< (GPBR) General Purpose Backup Register 7 */


/** @} */

#endif /* SERIES_MAP_H_ */
